[
{"Title": "Cisco Systems", "Organization_name": "Cisco Systems, Inc.", "Type": "Public", "Traded as": "NASDAQ: CSCO, NASDAQ-100 component, DJIA component, S&P 100 component, S&P 500 component", "ISIN": "US17275R1023", "Industry": "Networking hardware & software", "Predecessor": "Riverhead Networks, Hammerhead Networks", "Founded": "December 10, 1984 ; 34 years ago (1984-12-10) in San Francisco, California, United States", "Founders": "Leonard Bosack, Sandy Lerner", "Headquarters": "San Jose, California, United States", "Area served": "Worldwide", "Key people": "Chuck Robbins (CEO and Chairman), Mark Chandler (CLO), Gerri Elliott (CMO)", "Products": "List of Cisco products", "Revenue": "US$49.33 billion (2018)", "Operating income": "US$12.77 billion (2018)", "Net income": "US$110 million (2018)", "Total assets": "US$108.78 billion (2018)", "Total equity": "US$43.20 billion (2018)", "Number of employees": "74,200 (2018)", "Subsidiaries": "List of acquisitions by Cisco Systems", "Website": "cisco.com", "strings": ["Cisco Systems, Inc. is an American multinational technology conglomerate headquartered in San Jose, California, in the center of Silicon Valley. Cisco develops, manufactures and sells networking hardware, telecommunications equipment and other high-technology services and products.", "Cisco stock was added to the Dow Jones Industrial Average on June 8, 2009, and is also included in the S&P 500 Index, the Russell 1000 Index, NASDAQ-100 Index and the Russell 1000 Growth Stock Index.", "Cisco Systems was founded in December 1984 by Leonard Bosack and Sandy Lerner, two Stanford University computer scientists. They pioneered the concept of a local area network (LAN) being used to connect geographically disparate computers over a multiprotocol router system. By the time the company went public in 1990, Cisco had a market capitalization of $224 million. By the end of the dot-com bubble in the year 2000, Cisco had a more than $500 billion market capitalization.", "Cisco Systems was founded in December 1984 by Sandy Lerner, a director of computer facilities for the Stanford University Graduate School of Business. Lerner partnered with her husband, Leonard Bosack, who was in charge of the Stanford University computer science department's computers.", "Cisco's initial product has roots in Stanford University's campus technology. In the early 1980s students and staff at Stanford; including Bosack, used technology on the campus to link all of the school's computer systems to talk to one another, creating a box that functioned as a multiprotocol router called the \"Blue Box\".", "In 1985, Bosack and Stanford employee Kirk Lougheed began a project to formally network Stanford's campus.", "The name \"Cisco\" was derived from the city name San Francisco, which is why the company's engineers insisted on using the lower case \"cisco\" in its early years. The logo is intended to depict the two towers of the Golden Gate Bridge.", "On February 16, 1990, Cisco Systems went public with a market capitalization of $224 million, and was listed on the NASDAQ stock exchange. On August 28, 1990, Lerner was fired. Upon hearing the news, her husband Bosack resigned in protest.", "Although Cisco was not the first company to develop and sell dedicated network nodes,", "Between 1992 and 1994, Cisco acquired several companies in Ethernet switching, such as Kalpana,", "In 1995, John Morgridge was succeeded by John Chambers.", "The Internet Protocol (IP) became widely adopted in the mid-to-late 1990s.", "The perceived complexity of programming routing functions in silicon led to the formation of several startups determined to find new ways to process IP and MPLS packets entirely in hardware and blur boundaries between routing and switching. One of them, Juniper Networks, shipped their first product in 1999 and by 2000 chipped away about 30% from Cisco SP Market share. In response, Cisco later developed homegrown ASICs and fast processing cards for GSR routers and Catalyst 6500 switches. In 2004, Cisco also started the migration to new high-end hardware CRS-1 and software architecture IOS-XR.", "As part of a rebranding campaign in 2006, Cisco Systems adopted the shortened name \"Cisco\" and created \"The Human Network\" advertising campaign.", "On the more traditional business side, Cisco continued to develop its routing, switching and security portfolio. The quickly growing importance of Ethernet also influenced the company's product lines. Limits of IOS and aging Crescendo architecture also forced Cisco to look at merchant silicon in the carrier Ethernet segment. This resulted in a new ASR9000 product family intended to consolidate the company's carrier ethernet and subscriber management business around EZChip-based hardware and IOS-XR.", "Throughout the mid-2000s, Cisco also built a significant presence in India, establishing its Globalization Centre East in Bangalore for $1 billion.", "Cisco continued to be challenged by both domestic competitors Alcatel-Lucent, Juniper Networks and overseas competitor Huawei. Due to lower-than-expected profit in 2011, Cisco reduced annual expenses by $1 billion. The company cut around 3,000 employees with an early-retirement program who accepted buyout and planned to eliminate as many as 10,000 jobs (around 14 percent of the 73,400 total employees before curtailment). including Juniper and HP.", "On July 24, 2012, Cisco received approval from the EU to acquire NDS (a TV software developer) for US$5 billion.", "On July 23, 2013, Cisco Systems announced a definitive agreement to acquire Sourcefire for $2.7 billion.", "In April 2014, Cisco announced funding for early-stage firms to focus on the Internet of Things. The investment fund was allocated to investments in IoT accelerators and startups such as The Alchemist Accelerator, Ayla Networks and EVRYTHNG.", "On May 4, 2015, Cisco announced CEO and Chairman John Chambers would step down as CEO on July 26, 2015, but remain chairman. Chuck Robbins, senior vice president of worldwide sales & operations and 17-year Cisco veteran, was announced as the next CEO.", "In January 2016, Cisco invested in VeloCloud, a software-defined WAN (SD-WAN) start-up with a cloud offering for configuring and optimizing branch office networks. Cisco contributed to VeloCloud's $27 million Series C round, led by March Capital Partners.", "In February 2017, Cisco launched a cloud-based secure internet gateway, called Cisco Umbrella, to provide safe internet access to users who don't use their corporate networks or VPNs to connect to remote data centers.", "Reuters reported that \"Cisco Systems Inc’s (CSCO.O) product revenue in Russia grew 20 percent in 2017, ahead of Cisco’s technology product revenue growth in the other so-called BRIC countries of Brazil, China and India.\"", "On May 1, 2018, Cisco Systems agreed to buy AI-driven business intelligence startup Accompany for $270 million.", "For the fiscal year 2017, Cisco reported earnings of US$0.1 billion, with an annual revenue of US$49.3 billion, an increase of 2.8% over the previous fiscal cycle. Cisco's shares traded at over $43 per share, and its market capitalization was valued at US$213.2 billion in September 2018. Low Net Income for fiscal year 2018 was attributed to a one time tax charge, that allowed Cisco to bring back capital from overseas. Cisco used this money it was able to bring back at a lower tax rate to fund share buybacks and acquisitions.", "Cisco acquired a variety of companies to spin products and talent into the company. In 1995–1996 the company completed 11 acquisitions. Several acquired companies have grown into $1Bn+ business units for Cisco, including LAN switching, Enterprise Voice over Internet Protocol (VOIP) platform Webex and home networking. The latter came as result of Cisco acquiring Linksys in 2003 and in 2010 was supplemented with new product line dubbed Cisco Valet.", "Cisco announced on January 12, 2005, that it would acquire Airespace for US$450 million to reinforce the wireless controller product lines.", "Cisco announced on January 4, 2007, that it would buy IronPort in a deal valued at US$830 million", "Cisco announced on March 15, 2012, that it would acquire NDS Group for $5bn.", "In more recent merger deals, Cisco bought Starent Networks (a mobile packet core company) and Moto Development Group, a product design consulting firm that helped develop Cisco's Flip video camera.", "Although many buy-ins (such as Crescendo Networks in 1993, Tandberg in 2010) resulted in acquisition of flagship technology to Cisco, many others have failed—partially or completely.", "January 2013, Cisco Systems acquired Israeli software maker Intucell for around $475 million in cash, a move to expand its mobile network management offerings. and Ubiquisys (mobile software) in April 2013.", "Cisco acquired cyber-security firm Sourcefire, in October 2013.", "June 17, 2014, Cisco announced its intent to acquire privately held Tail-f Systems, a leader in multi-vendor network service orchestration solutions for traditional and virtualized networks.", "April 2, 2015, Cisco announced plans to buy Embrane, a software-defined networking startup. The deal will give Cisco Embrane's software platform, which provides layer 3–7 network services for things such as firewalls, VPN termination, server load balancers and SSL offload.", "May 7, 2015 Cisco announced plans to buy Tropo, a cloud API platform that simplifies the addition of real-time communications and collaboration capabilities within applications.", "June 30, 2015, Cisco acquired privately-held OpenDNS, the company best known for its DNS service that adds a level of security by monitoring domain name requests.", "August 6, 2015, Cisco announced that it has completed the acquisition of privately held MaintenanceNet, the US-based company best known for its cloud-based contract management platform ServiceExchange.", "September 30, 2015, Cisco announced its intent to acquire privately held Portcullis Computer Security, a UK-based company that provides cybersecurity services to enterprise clients and the government sectors.", "October 26, 2015, Cisco announced its intent to acquire ParStream, a privately held company based in Cologne, Germany, that provides an analytics database that allows companies to analyze large amounts of data and store it in near real-time anywhere in the network.", "October 27, 2015, Cisco announced that it would acquire Lancope, a company that focuses on detecting threat activity, for $452.5 million in a cash-and-equity deal.", "June 28, 2016, Cisco announced its intent to acquire CloudLock, a privately held cloud security company founded in 2011 by three Israeli military veterans, The deal was expected to close in the first quarter of 2017.", "In August 2016, Cisco announced it is getting closer to making a deal to acquire Springpath, the startup whose technology is used in Cisco's HyperFlex Systems. Cisco already owns an undisclosed stake in the hyper-converged provider.", "January 2017, Cisco announced they would acquire AppDynamics, a company that monitors application performance, for $3.7 billion. The acquisition came just one day before AppDynamics was set to IPO.", "January 26, 2017, Cisco founded the Innovation Alliance in Germany with eleven other companies bringing together 40 sites and 2,000 staff to provide small businesses in Germany with expertise.", "August 1, 2017 Cisco completed the acquisition of Viptela Inc. for $610 million in cash and assumed equity awards. Viptela was a privately held software-defined wide area network (SD-WAN) company based in San Jose, Ca.", "October 23, 2017, Cisco Systems announced it would be acquiring Broadsoft for $1.9 Billion to further entrench itself in the cloud communication and collaboration area.", "As of 2017 Cisco Systems shares are mainly held by institutional investors (The Vanguard Group, BlackRock, State Street Corporation and others )", "Cisco's products and services focus upon three market segments—enterprise, service provider, midsize and small business.", "Cisco provides IT products and services across five major technology areas: Networking (including Ethernet, optical, wireless and mobility), Security, Collaboration (including voice, video, and data), Data Center, and the Internet of Things.", "Cisco has grown increasingly popular in the Asia-Pacific region over the last three decades[when?] and is the dominant vendor in the Australian market with leadership across all market segments.[citation needed] It uses its Australian office as one of the main headquarters for the Asia-Pacific region.", "Cisco became a major provider of Voice over IP to enterprises and is now moving into the home user market through its acquisitions of Scientific Atlanta and Linksys. Scientific Atlanta provides VoIP equipment to cable service providers such as Time Warner, Cablevision, Rogers Communications, UPC and others; Linksys has partnered with companies such as Skype, Microsoft and Yahoo! to integrate consumer VoIP services with wireless and cordless phones.", "Cisco partners can offer cloud-based services based on Cisco's virtualized Unified Computing System (UCS). A part of the Cisco Unified Services Delivery Solution that includes hosted versions of Cisco Unified Communications Manager (UCM), Cisco Unified Contact Center, Cisco Unified Mobility, Cisco Unified Presence, Cisco Unity Connection (unified messaging) and Cisco Webex Meeting Center.", "As part of its Tactical Operations initiative, Cisco maintains several Network Emergency Response Vehicles (NERV)s.", "NERVs are based at Cisco headquarters sites in San Jose, California and at Research Triangle Park, North Carolina, allowing strategic deployment in North America. They can become fully operational within 15 minutes of arrival. High-capacity diesel fuel-tanks allow the largest vehicles to run for up to 72 hours continuously.", "The Tactical Operations team maintains and deploys smaller, more portable communication kits to emergencies outside of North America. In 2010, the team deployed to assist in earthquake recovery in Haiti and Christchurch (New Zealand). In 2011, they deployed to flooding in Brazil, as well as in response to the 2011 earthquake and tsunami in Japan.", "In 2011, Cisco received the Innovation Preparedness award from the American Red Cross Silicon Valley Chapter for its development and use of these vehicles in disasters.", "Cisco Systems also sponsors a line of IT professional certifications for Cisco products. as well as nine different paths, Routing & Switching, Design, Industrial Network, Network Security, Service Provider, Service Provider Operations, Storage Networking, Voice, Datacenter and Wireless.", "A number of the specialist technician, sales and datacenter certifications are also available.", "Cisco also provides training for these certifications via a portal called the Cisco Networking Academy. Qualifying schools can become members of the Cisco Networking Academy and then provide CCNA level or other level courses. Cisco Academy Instructors must be CCNA certified to be a CCAI certified instructor.", "Cisco often finds itself involved with technical education. With over 10,000 partnerships in over 65 countries", "Cisco products, including IP phones and Telepresence, have been seen in movies and TV series.", "Cisco was a 2002–03 recipient of the Ron Brown Award,", "According to a report by technology consulting firm LexInnova, Cisco was one of the leading recipients of network security-related patents with the largest portfolio within other companies (6,442 security-related patents) in 2015.", "A class action lawsuit filed on April 20, 2001, accused Cisco of making misleading statements that \"were relied on by purchasers of Cisco stock\" and of insider trading.", "On December 11, 2008, the Free Software Foundation filed suit against Cisco regarding Cisco's failure to comply with the GPL and LGPL license models and make the applicable source code publicly available.", "Cisco has been criticized for its involvement in censorship in the People's Republic of China.", "Wired News had uncovered a leaked, confidential Cisco PowerPoint presentation that detailed the commercial opportunities of the Golden Shield Project of Internet control. in September 2015.", "In October 2007, employees of Cisco's Brazilian unit were arrested on charges that they had imported equipment without paying import duties. In response, Cisco stated that they do not import directly into Brazil, and instead use middlemen.", "On December 1, 2008, Multiven filed an antitrust lawsuit", "Cisco's Linksys E2700, E3500, E4500 devices have been reported to be remotely updated to a firmware version that forces users to register for a cloud service, allows Cisco to monitor their network use and ultimately shut down the cloud service account and thus render the affected router unusable.", "According to the German magazine Der Spiegel the NSA has developed JETPLOW for gaining access to ASA (series 5505, 5510, 5520, 5540 and 5550) and 500-series PIX Firewalls.", "Cisco's Chief Security Officer addressed the allegations publicly and denied working with any government to weaken Cisco products for exploitation or to implement security back doors.", "A document included in the trove of National Security Agency files released with Glenn Greenwald's book No Place to Hide details how the agency's Tailored Access Operations (TAO) unit and other NSA employees intercept servers, routers and other network gear being shipped to organizations targeted for surveillance and install covert firmware onto them before they are delivered. These Trojan horse systems were described by an NSA manager as being “some of the most productive operations in TAO because they pre-position access points into hard target networks around the world.”", "Cisco denied the allegations in a customer document", "In March 2014 Cisco Systems was sued for patent infringement. Spherix says that over $43 billion of Cisco's sales infringe on old Nortel patents owned by Spherix. Officials with Spherix are saying that a wide range of Cisco products, from switches to routers, infringe on 11 former Nortel patents that the company now owns.", "In January 2008, Cisco announced an investment of $10 million over three years towards job creation and technology sector development in the Palestinian Territories. According to Cisco, this project was in cooperation with Palestinian Authority President Mahmoud Abbas."]},
{"Title": "VMware", "Organization_name": "VMware Inc.", "Type": "Public", "Traded as": "NYSE : VMW Russell 1000 Component", "ISIN": "US9285634021", "Industry": "Computer software", "Founded": "October 26, 1998 ; 21 years ago (1998-10-26) Palo Alto, California, U.S.", "Founder": "Diane Greene Mendel Rosenblum Scott Devine Ellen Wang Edouard Bugnion", "Headquarters": "Palo Alto, California, United States", "Key people": "Michael Dell (Chairman) Pat Gelsinger (CEO) Sanjay Poonen (COO)", "Products": "VMware vSphere, VMware ESXi, VMware Workstation, VMware Integrated Openstack, VMware Fusion, VMware Cloud Foundation, VMware Player, VMware Server (discontinued), VMware Service Manager, VMware ThinApp, VMware View, ACE, vCloud Director, VMware Learning Platform, VMware Infrastructure, Converter, Site Recovery Manager, Stage Manager, vRealize Automation, vRealize Automation Cloud, vRealize Operations, VMware NSX, vRealize Business, VMware vSAN, AppVolumes, vRealize Log Insight, vRealize Network Insight, vRealize CodeStream, vRealize Orchestrator, VMware Workspace ONE (AirWatch)", "Revenue": "US$ 8.97 billion (2018)", "Operating income": "US$ 2.05 billion (2018)", "Net income": "US$ 2.42 billion (2018)", "Total assets": "US$ 14.662 billion (2018)", "Total equity": "US$ 8.097 billion (2016)", "Owner": "Dell Technologies (80.8% economic; 97.5% voting)", "Number of employees": "24,200 (2019)", "Website": "www.vmware.com", "strings": ["VMware, Inc. is a publicly traded software company listed on the NYSE under stock ticker VMW. Dell Technologies is a majority share holder. VMware provides cloud computing and virtualization software and services.", "VMware's desktop software runs on Microsoft Windows, Linux, and macOS, while its enterprise software hypervisor for servers, VMware ESXi, is a bare-metal hypervisor that runs directly on server hardware without requiring an additional underlying operating system.", "In 1998, VMware was founded by Diane Greene, Mendel Rosenblum, Scott Devine, Ellen Wang and Edouard Bugnion.", "In 2003, VMware launched VMware Virtual Center, vMotion, and Virtual SMP technology. 64-bit support was introduced in 2004.", "On January 9, 2004, under the terms of the definitive agreement announced on December 15, 2003, EMC (now Dell EMC) acquired the company with $625 million in cash.", "On July 8, 2008, after disappointing financial performance, the board of directors fired VMware co-founder, president and CEO Diane Greene, who was replaced by Paul Maritz, a retired 14-year Microsoft veteran who was heading EMC's cloud computing business unit.", "On September 16, 2008, VMware announced a collaboration with Cisco Systems.", "In April 2011, EMC transferred control of the Mozy backup service to VMware.", "On April 12, 2011, VMware released an open-source platform-as-a-service system called Cloud Foundry, as well as a hosted version of the service. This supported application deployment for Java, Ruby on Rails, Sinatra, Node.js, and Scala, as well as database support for MySQL, MongoDB, Redis, Postgres, RabbitMQ.", "In March 2013, VMware announced the corporate spin-off of Pivotal Software, with General Electric making an investment in the company. All of VMware's application- and developer-oriented products, including Spring, tc Server, Cloud Foundry, RabbitMQ, GemFire, and SQLFire were transferred to this organization.", "In May 2013, VMware launched its own IaaS service, vCloud Hybrid Service, at its new Palo Alto headquarters (vCloud Hybrid Service was rebranded vCloud Air and subsequently sold to cloud provider OVH), announcing an early access program in a Las Vegas data center. The service is designed to function as an extension of its customer's existing vSphere installations, with full compatibility with existing virtual machines virtualized with VMware software and tightly integrated networking. The service is based on vCloud Director 5.1/vSphere 5.1.", "In September 2013, at VMworld San Francisco, VMware announced general availability of vCloud Hybrid Service and expansion to Sterling, Virginia, Santa Clara, California, Dallas, Texas, and a service beta in the UK. It announced the acquisition Desktone in October 2013.", "In January 2016, in anticipation of Dell's acquisition of EMC, VMware announced a restructuring to reduce about 800 positions, and some executives resigned.", "In April 2016, VMware president and COO Carl Eschenbach left VMware to join Sequoia Capital, and Martin Casado, VMware's general manager for its Networking and Security business, left to join Andreessen Horowitz. Analysts commented that the cultures at Dell and EMC, and at EMC and VMware, are different, and said that they had heard that impending corporate cultural collisions and potentially radical product overlap pruning, would cause many EMC and VMware personnel to leave;", "In August 2016 VMware introduced the VMware Cloud Provider website. New branch role is funneling cloud related information as central source of cloud provider technology content. Thanks to a “services first” approach, cloud providers can find differentiated and monetizable services they can deliver leveraging VMware’s platform. Now the latest case studies, demos, blogs and architecture toolkits of VMware are available in one place.", "Mozy was transferred to Dell in 2016 after the merger of Dell and EMC.", "In April 2017, according to Glassdoor, VMware was ranked 3rd on the list of highest paying companies in the United States.", "In Q2 2017, VMware sold vCloud Air to French cloud service provider OVH.", "In August 2017, VMware and Amazon Web Services jointly announced the launch of VMware Cloud on AWS, a SaaS service delivering a vSphere compatible cloud in an AWS datacentre. VMware has since returned to the “hybrid cloud” naming convention to describe this use of consistent platform across on-prem and public clouds.[citation needed]", "Conceptually similar services, but not managed directly by VMware, have since been announced by CloudSimple and Virtustream, hosted in Azure and by CloudSimple hosted in Google Cloud, built on the VMware Cloud Provider Program.", "In March 2015, the Software Freedom Conservancy announced it was funding litigation by Christoph Hellwig in Hamburg, Germany against VMware for alleged violation of his copyrights in its ESXi product.", "The lawsuit was dismissed by the court in July 2016", "VMware's most notable products are its hypervisors. VMware became well known for its first type 2 hypervisor known as GSX. This product has since evolved into two hypervisor products lines: VMware's type 1 hypervisors running directly on hardware and their hosted type 2 hypervisors.", "VMware software provides a completely virtualized set of hardware to the guest operating system. (or, with vMotion Storage, separate storage can be used, too). Each of these transitions is completely transparent to any users on the virtual machine at the time it is being migrated.", "VMware Workstation, Server, and ESX take a more optimized path to running target operating systems on the host than that of emulators (such as Bochs) which simulate the function of each CPU instruction on the target machine one-by-one, or that of dynamic recompilation which compiles blocks of machine-instructions the first time they execute, and then uses the translated code directly when the code runs subsequently (Microsoft Virtual PC for macOS takes this approach). VMware software does not emulate an instruction set for different hardware not physically present. This significantly boosts performance, but can cause problems when moving virtual machine guests between hardware hosts using different instruction sets (such as found in 64-bit Intel and AMD CPUs), or between hardware hosts with a differing number of CPUs. Software that is CPU agnostic can usually survive such a transition, unless it is agnostic by forking at startup, in which case, the software or the guest OS must be stopped before moving it, then restarted after the move.", "VMware's products predate the virtualization extensions to the x86 instruction set, and do not require virtualization-enabled processors. On newer processors, the hypervisor is now designed to take advantage of the extensions. However, unlike many other hypervisors, VMware still supports older processors. In such cases, it uses the CPU to run code directly whenever possible (as, for example, when running user-mode and virtual 8086 mode code on x86). When direct execution cannot operate, such as with kernel-level and real-mode code, VMware products use binary translation (BT) to re-write the code dynamically. The translated code gets stored in spare memory, typically at the end of the address space, which segmentation mechanisms can protect and make invisible. For these reasons, VMware operates dramatically faster than emulators, running at more than 80% of the speed that the virtual guest operating system would run directly on the same hardware. In one study VMware claims a slowdown over native ranging from 0–6 percent for the VMware ESX Server.", "VMware's approach avoids some of the difficulties of virtualization on x86-based platforms. Virtual machines may deal with offending instructions by replacing them, or by simply running kernel code in user mode. Replacing instructions runs the risk that the code may fail to find the expected content if it reads itself; one cannot protect code against reading while allowing normal execution, and replacing in place becomes complicated. Running the code unmodified in user mode will also fail, as most instructions which just read the machine state do not cause an exception and will betray the real state of the program, and certain instructions silently change behavior in user mode. One must always rewrite, performing a simulation of the current program counter in the original location when necessary and (notably) remapping hardware code breakpoints.", "Although VMware virtual machines run in user mode, VMware Workstation itself requires the installation of various device drivers in the host operating system, notably to dynamically switch the Global Descriptor Table (GDT) and the Interrupt Descriptor Table (IDT).", "The VMware product line can also run different operating systems on a dual-boot system simultaneously by booting one partition natively while using the other as a guest within VMware Workstation.", "VMware ESXi, an enterprise software product, can deliver greater performance than the freeware VMware Server, due to lower system computational overhead. VMware ESXi, as a \"bare-metal\" product, runs directly on the server hardware, allowing virtual servers to also use hardware more or less directly. In addition, VMware ESXi integrates into VMware vCenter, which offers extra services", "The VMware Workspace Portal was a self-service app store for workspace management.", "VMware's storage and availability products are composed of two primary offerings:", "VMware NSX is VMware's network virtualization product marketed using the term software-defined data center (SDDC).", "Workspace ONE allows mobile users to access to apps and data.", "The VIX (Virtual Infrastructure eXtension", "Coordinates: 37°24′08′′N 122°08′41′′W﻿ / ﻿37.4021124°N 122.1445973°W﻿ / 37.4021124; -122.1445973"]},
{"Title": "Big Switch Networks", "Organization_name": "Big Switch Networks", "Type": "Private", "Industry": "Technology", "Founded": "2010", "Headquarters": "Santa Clara, California, United States", "Key people": "CEO: Douglas Murray; Founder: Kyle Forster; CFO: Seamus Hennessy", "Products": "Big Monitoring Fabric; Big Cloud Fabric", "Number of employees": "200-500", "Website": "www.bigswitch.com", "strings": ["Big Switch Networks is a cloud and data center networking company. The company was founded by Kyle Forster and Guido Appenzeller in 2010 and has roots in the original Stanford research team that invented software defined networking (SDN).", "Big Switch has two products: Big Monitoring Fabric, a network packet broker (NPB) fabric, which enables security and monitoring of data center and cloud traffic as well as provide capacity and security insights to that traffic by leveraging Big Monitoring Analytics Node and Recorder Node. Big Cloud Fabric is a leaf-spine data center switching fabric for VMware SDDC, Nutanix, Openstack and container use cases. Big Switch software runs on open Ethernet networking switches from Accton Edgecore, Dell EMC, and Hewlett Packard Enterprise (HPE), and leverage centralized software defined networking controller software for fabric-wide control and management.", "Douglas Murray, a former Juniper Networks and Sun Microsystems executive, joined the company as CEO in 2013 as the company went through a significant pivot following VMware's acquisition of Nicira.", "In 2013 the company released its first commercial product, Big Monitoring Fabric and in 2014 the company released Big Cloud Fabric. Customers include: Verizon, Big Switch is headquartered in Santa Clara, CA.", "Switch Light OS: An operating system for open network Ethernet switches based on Open Network Linux (ONL), an open source effort within the Open Compute Project.", "Switch Light vSwitch: A user space software module for KVM-based virtual switches that adds enhanced functionality and improved performance on top of the Open vSwitch kernel.", "Big Monitoring Fabric: Big Monitoring Fabric is a visibility and security monitoring solution. It uses high-performance, open Ethernet switches and a controller-based SDN architecture to enable network-wide monitoring and inline tool chaining in the DMZ. It also has a DPDK-based Service Node appliance that connects to the Big Monitoring Fabric as a service to provide advanced network packet broker functions such as packet de-duplication, packet slicing, regular matching, and NetFlow generation. Big Monitoring Fabric also includes Analytics Node and Recorder Node for rich network visibility.", "Big Cloud Fabric: Big Cloud Fabric is an SDN controller-based data center switching fabric. It supports all workloads (physical, virtual machine, and container) and choice of orchestration software (VMware, OpenStack). It provides L2 switching, L3 routing, and L4-7 service insertion and chaining. The scalable fabric is fully resilient, with no single point of failure, and supports headless mode operations. Big Cloud Fabric is available in two editions:", "P Fabric — Leaf-spine physical Clos fabric controlled via SDN Controller", "P+V Fabric — Leaf-spine physical Clos fabric plus virtual switches controlled by SDN Controller", "Big Switch sponsors and participates in the following open source projects:"]},
{"Title": "D-Link", "Organization_name": "D-Link Corporation", "Type": "Public", "Traded as": "TWSE : 2332", "Industry": "Networking equipment", "Founded": "March 1986 ; 33 years ago (1986-03) (as Datex Systems Inc.) 1994 (as D-Link Corporation)", "Founder": "Ken Kao", "Headquarters": "Taipei, Taiwan", "Key people": "Lori Hu (Chairwoman)", "Products": "Routers, DSL/Cable Gateways, Switches, Wireless access points, Storage and security IP cameras", "Revenue": "NT$ 26,614 million (2015)", "Number of employees": "2,722 (2015)", "Website": "dlink.com", "strings": ["D-Link Corporation (Chinese: 友訊科技) is a Taiwanese multinational networking equipment manufacturing corporation headquartered in Taipei, Taiwan. It was founded in March 1986 in Taipei as Datex Systems Inc.", "D-Link Corporation changed its name from Datex Systems Inc. in 1994, when it went public and when it became the first networking company on the Taiwan Stock Exchange. It is now publicly traded on the TSEC and NSE stock exchanges.", "In 1988, Datex Systems Inc. released the industry's first peer-to-peer LANSmart Network Operating System , able to run concurrently with early networking systems such as Novell's NetWare and TCP/IP which most small network operating systems could not do at the time.", "In 2007, it was the leading networking company in the small to medium business (SMB) segment worldwide with 21.9% market share. .", "In 2013, D-Link released its flagship draft 802.11ac Wireless AC1750 Dual-Band Router (DIR-868L) which attained the fastest ever wireless throughput tested by SmallNetBuilder as of May, 2013.", "In April 2019, D-Link was named \"Gartner Peer Insights Customers’ Choice for Wired and Wireless LAN Access Infrastructure\".", "D-Link's products are geared towards the networking and communications market. Its business products include switches, surveillance network cameras, firewalls, iSCSI SANs and business wireless, while consumer products cover consumer wireless devices, broadband devices, and the Digital Home devices (which include media players, storage, and surveillance camera/NVR).", "In January 2010, it was reported that HNAP vulnerabilities had been found on some D-Link routers. D-Link was also criticized for their response which was deemed confusing as to which models were affected and downplayed the seriousness of the risk.", "In January 2013, version v1.13 for the DIR-100 revA was reported to include a backdoor in the firmware. By passing a specific user agent in an HTTP request to the router, normal authentication is bypassed. It was reported that this backdoor had been present for some time.", "Computerworld reported in January 2015 that ZynOS, a firmware used by some D-Link routers (as well as ZTE, TP-Link, and others), are vulnerable to DNS hijacking by an unauthenticated remote attacker, specifically when remote management is enabled.", "Later in 2015, it was reported that D-Link leaked the private keys used to sign firmware updates for the DCS-5020L security camera and a variety of other D-Link products. The key expired in September 2015, but had been published online for seven months.", "Also in 2015, D-Link was criticized for more HNAP vulnerabilities,", "On 5 January 2017, the Federal Trade Commission sued D-Link for failing to take reasonable steps to secure their routers and IP cameras. As D-Link marketing was misleading customers into believing their products were secure. The complaint also says security gaps could allow hackers to watch and record people on their D-Link cameras without their knowledge, target them for theft, or record private conversations.", "In 2006, D-Link was accused of NTP vandalism, when it was found that its routers were sending time requests to a small NTP server in Denmark, incurring thousands of dollars of costs to its operator. D-Link initially refused to accept responsibility.", "On 6 September 2006, the gpl-violations.org project prevailed in court litigation against D-Link Germany GmbH regarding D-Link's alleged inappropriate and copyright infringing use of parts of the Linux kernel."]},
{"Title": "Extreme Networks", "Organization_name": "Extreme Networks, Inc.", "Type": "Public", "Traded as": "NASDAQ: EXTR, S&P 600 component", "ISIN": "US30226D1063", "Industry": "Networking hardware", "Founded": "1996 ; 23 years ago (1996)", "Founders": "Stephen Haddock, Herb Schneider, Gordon Stitt", "Headquarters": "San Jose, California, United States", "Key people": "Ed Meyercord (President, CEO), Eric Broockman (CTO, Engineering Officer) Remi Thomas (CFO)", "Products": "BlackDiamond 6800, ExtremeXOS", "Revenue": "US$983.1 million (2018)", "Operating income": "US$-0.733 million (2017)", "Net income": "US$-8.5 million (2017)", "Number of employees": "2,713 (2019)", "Website": "extremenetworks.com", "strings": ["Extreme Networks is a networking company based in San Jose, California. Extreme Networks designs, develops, and manufactures wired and wireless network infrastructure equipment and develops the software for network management, policy, analytics, security and access controls.", "Extreme Networks was established by co-founders Gordon Stitt, Herb Schneider and Stephen Haddock in 1996 in California, USA, with its first offices located in Cupertino, which later moved to Santa Clara, and later to San Jose.", "Gordon Stitt was a co-founder and served as chief executive officer until August 2006, when he retired and became chairman of the board of directors. In October 1996 Extreme Networks acquired Mammoth Technology. In September 1997 Extreme Networks aided in providing the first multi-vendor Gigabit Ethernet backbone at the Networld+Interop trade show.The company's first product was the Summit1 Gigabit Ethernet switch, a 6 Port Ethernet Layer 3 switching device featuring dual Gigabit Interface Converter (GBIC) 1000BASE-SX interfaces. This product shipped in 1997 and won the \"Best of Show\" award at Networld+Interop. The Summit1 was also named the \"Best of the Best Grand Winner\" for the event. Extreme Networks won Best of Show awards at Networld+Interop five consecutive years, 1997 through 2001 with its Summit PX1 application switch, a Layer 4-7 device.", "Extreme Networks introduced its first modular switching products, including the BlackDiamond 6800 and Alpine 3800 switches, in 1999. The initial public offering in April 1999, was listed on the NASDAQ stock exchange as ticker \"EXTR.\" Extreme Networks announced its first 10 Gigabit Ethernet product in 2002, available with its modular BlackDiamond 6800 Ethernet Switch.", "In April 2013, Charles W. Berger (from ParAccel as it was acquired by Actian) replaced Oscar Rodriguez as CEO.", "On April 19, 2015, Charles W. Berger resigned as CEO, and was replaced by Board Chairman Ed Meyercord.", "On May 20, 2015, Extreme Networks announced a restructuring initiative which included plans to cut approximately 285 positions (around 18% of the global workforce, inclusive of contractors.)", "On October 28, 2015, Extreme introduced its new \"Connect Beyond the Network\" tagline. 2016 saw Extreme enter a new market with the introduction of ExtremeCloud.", "On October 31, 2016, Extreme Networks announced that it completed the acquisition of Zebra Technologies ' Wireless LAN business for about $55 million.", "On March 7, 2017, Extreme Networks announced its intention to acquire Avaya's networking business in a transaction valued at $100 million.", "On March 29, 2017, Extreme Networks announced its intention to acquire Brocade's SRA (Switching, Routing, and Analytics) business from Broadcom for an undisclosed sum.", "On June 26, 2019, Extreme Networks announced its intention to acquire Aerohive Networks for $272 million. . Aerohive's cloud-managed portfolio of wireless, LAN, and SD-WAN products is well-regarded in the industry.", "Therefore, through a series of historical and contemporary merger and acquisition activity, Extreme Network claims an industry lineage that includes, at a minimum, the networking-focused elements of the following companies: Digital, Chantry, Siemens, Cabletron, Enterasys, AirDefense, Symbol, Motorola, Zebra, Wellfleet, SynOptics, Bay Networks, Nortel Networks, Avaya, Vistapointe, StackStorm, Foundry Networks, and Brocade. Extreme Networks itself claims that the combined entity should now be able to generate annual revenues in the region of US $1 billion and to now rank in the top three enterprise networking companies (measured by revenue),"]},
{"Title": "Arista Networks", "Organization_name": "Arista Networks, Inc.", "Type": "Public", "Traded as": "NYSE: ANET, S&P 500 component", "ISIN": "US0404131064", "Industry": "Networking hardware", "Founded": "October 2004 ; 15 years ago (2004-10)", "Founders": "Andy Bechtolsheim, David Cheriton, Kenneth Duda", "Headquarters": "Santa Clara, California, U.S.", "Key people": "Jayshree Ullal (President and CEO), Andy Bechtolsheim (CDO and Chairman), Kenneth Duda (CTO), John McCool (CPO)", "Products": "Extensible Operating System", "Revenue": "US$ 2,151.4 million (2018)", "Operating income": "US$273.3 million (2018)", "Net income": "US$328.1 million (2018)", "Total assets": "US$3,082.0 million (2018)", "Total equity": "US$2,143.4 million (2018)", "Number of employees": "≈2,300 (2018)", "Website": "arista.com", "strings": ["Arista Networks (previously Arastra modular 10G/40G/100Gbit/s switch. Arista's own Linux-based network operating system, EOS (Extensible Operating System), runs on all Arista products.", "Andy Bechtolsheim co-founded Sun Microsystems in 1982 and was its chief hardware designer. In 1995, David Cheriton co-founded Granite Systems with Bechtolsheim, a company that developed Gigabit Ethernet products, which was acquired by Cisco Systems in 1996.", "In 2004, the three then went on to found Arastra (later renamed Arista", "In June 2014, Arista Networks had its initial public offering on the New York Stock Exchange under the symbol ANET.", "In December 2014, Cisco filed two lawsuits against Arista alleging extensive intellectual property infringement.", "In August 2018, Arista Networks acquired their first company, Mojo Networks.", "Arista's CEO, Jayshree Ullal has been named to Barron’s “World’s Best CEOs” in 2018 and 2019.", "EOS is Arista's network operating system, and comes as a single image that runs across all Arista devices Since agents are independent processes, they can also be upgraded while the switch is running (a feature called ISSU – In-Service Software Upgrade).", "The fact that EOS runs on Linux allows the usage of common Linux tools on the switch itself, such as tcpdump or configuration management systems. EOS provides extensive APIs to communicate with and control all aspects of the switch. To showcase EOS' extensibility, Arista developed a module dubbed CloudVision This was implemented simply by integrating an existing open-source XMPP Python library with the CLI.", "In addition to all the standard programming and scripting capabilities traditionally available in a Linux environment, EOS can be programmed using different mechanisms:", "Arista's product line can be separated into different product families:", "The low-latency of Arista switches has made the platform prevalent in high-frequency trading environments, such as the Chicago Board Options Exchange", "Arista's devices are multilayer switches, which support a range of layer 3 protocols, including IGMP, VRRP, RIP, BGP, OSPF, IS-IS, as well as OpenFlow. The switches are also capable of layer 3 or layer 4 ECMP, and applying per-port L3/L4 ACLs entirely in hardware.", "All of Arista's switches are built using merchant silicon instead of custom switching ASICs. This strategy enables Arista to leverage latest advances in processor manufacturing technology at a lower price point, due to the prohibitive costs associated with the development and production of custom chips. Other major competitors such as Cisco and Juniper have also started following the same strategy, The integration of the chips with the rest of the system (including integration with the MAC, PHY, and device drivers on the control plane) and software are what differentiate the competing products.", "In November 2013, Arista Networks introduced the Spline network, combining leaf and spine architectures into a single-tier network, which aims to cut operational costs.", "In September 2015, Arista introduced the 7060X, 7260X and 7320X Series, refreshing the existing 7050X, 7250X and 7300X with new higher performance 100GbE options."]},
{"Title": "Hewlett Packard Enterprise", "Organization_name": "Hewlett Packard Enterprise Company", "Type": "Public", "Traded as": "NYSE: HPE, S&P 500 component", "ISIN": "US42824C1099", "Industry": "Computer hardware Computer software Cloud computing Internet of Things (IoT) Artificial intelligence Data storage and services Computer networking Blockchain", "Predecessor": "Hewlett-Packard", "Founded": "November 1, 2015 ; 4 years ago (2015-11-01)", "Headquarters": "6280 America Center Dr., San Jose, California, United States", "Area served": "Worldwide", "Key people": "Patricia Russo (Chairwoman), Antonio Neri(President and CEO)", "Products": "supercomputer, network-attached storage, storage area network, networking hardware, cloud computing", "Services": "Consulting", "Revenue": "US$ 30.85 billion (2018)", "Operating income": "US$1.85 billion (2018)", "Net income": "US$1.90 billion (2018)", "Total assets": "US$55.49 billion (2018)", "Total equity": "US$21.23 billion (2018)", "Number of employees": "60,000 (2018)", "Divisions": "Enterprise Group (services, storage, network, networking, consulting, support), Software, Financial Services, Hewlett Packard Labs", "Subsidiaries": "Aruba Networks", "Website": "www.hpe.com", "strings": ["The Hewlett Packard Enterprise Company (commonly referred to as HPE) is an American multinational enterprise information technology company based in San Jose, California, founded on 1 November 2015 as part of splitting of the Hewlett-Packard company. HPE is a business-focused organization with two divisions: Enterprise Group, which works in servers, storage, networking, consulting and support, and Financial Services. On 4 December HPE reported FY2018 net revenue of $30.9 billion, up 7% from the prior year period.", "The split was structured so that the former Hewlett-Packard Company would change its name to HP Inc. and spin off Hewlett Packard Enterprise as a newly created company. HP Inc. retained the old HP's personal computer and printing business, as well as its stock-price history and original NYSE ticker symbol for Hewlett-Packard; Enterprise trades under its own ticker symbol: HPE. According to notes from 2015,", "The full name for the company is \"Hewlett Packard Enterprise Company\", which drops the hyphen that previously existed between the \"Hewlett\" and \"Packard\" of the former Hewlett-Packard Company. The company is commonly referred to as \"Hewlett Packard Enterprise\" or by its initialism \"HPE\". The company has also been referred to as \"HP Enterprise\" by some media outlets", "In May 2016, the company announced it would sell its enterprise services division to one of its competitors, Computer Sciences Corporation in a deal valued at US$8.5 billion.", "In August 2016, the company announced plans to acquire Silicon Graphics International (SGI), known for their capabilities in high performance computing.", "On 7 September 2016, HPE announced a \"spin-merge\" with Micro Focus, where Micro Focus would acquire its \"non-core\" software, and HPE shareholders would own 50.1 percent of the merged company, which would retain its current name.", "In November 2016, PC World wrote \"HPE, and before it, Hewlett-Packard, failed to develop middleware tools to really make a dent in the software market, where other companies like IBM, SAP, and Oracle are excelling\" and that \"without major software product lines, HPE’s integrated offerings won’t be as strong as competitors like Dell, which have the software and hardware assets, adding that \"If all HPE is doing at this point is focusing largely on hardware, you have to ask what the end game here is.\"", "In September 2016, Hewlett Packard Enterprise transferred two patents to a Texas-based wholly owned shell company Plectrum LLC. These two patents were originated at the 3Com Corporation, which was bought by HP in 2010, along with about 1,400 patents. US Patent No. 6,205,149 is entitled \"Quality of service control mechanism and apparatus,\" while US Patent No. 5,978,951 describes the use of a \"high speed cache management unit\" which replaces some software-based systems with hardware in order to reduce latency time.", "On 11 April 2017, it was reported that Synack had raised US$21 million in a round of funding that included Hewlett Packard Enterprise.", "In January 2017, the company acquired data management platform SimpliVity, the developer of the OmniCube hyper-converged infrastructure appliance, for US$ 650M.", "In April 2017, Hewlett Packard Enterprise completed its acquisition of hybrid flash and all flash manufacturer, Nimble Storage Inc, for US$1.2 billion or US$12.50 per share. In October, Reuters reported that the company had allowed a Russian defense agency to examine a cyber-defense system used by The Pentagon. The report noted: \"Six former U.S. intelligence officials, as well as former ArcSight [Hewlett Packard Enterprise] employees and independent security experts, said the source code review could help Moscow discover weaknesses in the software, potentially helping attackers to blind the U.S. military to a cyber attack.\"", "In November 2017, Meg Whitman announced that she will be stepping down as CEO, after six years at the helm of HP and HPE, she noted that on 1 February 2018 Antonio Neri", "In June 2018, Hewlett Packard Enterprise launched a hybrid cloud service called GreenLake Hybrid Cloud, which is built on top of HPE's OneSphere cloud management SaaS offering.", "In February 2019, Meg Whitman announced that she will not be seeking re-election to the board of directors, ending her professional involvement in HPE.", "In May 2019, Hewlett Packard Enterprise announced plans to acquire Cray for nearly US$1.3 billion or US$35 per share, soon after Cray landed a US$600 million US Department of Energy contract to supply the Frontier supercomputer to Oak Ridge National Laboratory in 2021.", "In September 2019, Hewlett Packard Enterprise completed the acquisition of Cray for US$1.4 billion"]},
{"Title": "Juniper Networks", "Organization_name": "Juniper Networks, Inc.", "Type": "Public", "Traded as": "NYSE: JNPR, S&P 500 component", "ISIN": "US48203R1041", "Industry": "Networking hardware", "Founded": "February 6, 1996 ; 23 years ago (1996-02-06)", "Founder": "Pradeep Sindhu", "Headquarters": "Sunnyvale, California, United States", "Key people": "Scott Kriens (Chairman), Pradeep Sindhu (Vice Chairman), Rami Rahim (CEO), Bikash Koley (CTO)", "Products": "router, switch, computer security, business software, networking hardware", "Revenue": "US$4.6 billion (2018)", "Operating income": "US$848 million (2017)", "Net income": "US$306 million (2017)", "Owner": "Elliott Management Corporation (0.994)", "Number of employees": "9,283 (2018)", "Website": "juniper.net", "strings": ["Juniper Networks, Inc. is an American multinational corporation headquartered in Sunnyvale, California. The company develops and markets networking products, including routers, switches, network management software, network security products, and software-defined networking technology.", "The company was founded in 1996 by Pradeep Sindhu, with Scott Kriens as the first CEO, who remained until September 2008. Kriens has been credited with much of Juniper's early market success. It grew to $4 billion in revenues by 2004 and $4.63 billion in 2014. Juniper appointed Kevin Johnson as CEO in 2008, Shaygan Kheradpir in 2013 and Rami Rahim in 2014.", "Juniper Networks originally focused on core routers, which are used by internet service providers (ISPs) to perform IP address lookups and direct internet traffic. Through the acquisition of Unisphere, in 2002, the company entered the market for edge routers, which are used by ISPs to route internet traffic to individual consumers. In 2003, Juniper entered the IT security market with its own JProtect security toolkit before acquiring security company NetScreen Technologies the following year. In the early 2000s, Juniper entered the enterprise segment, which accounted for one-third of its revenues by 2005. As of 2014[update], Juniper has been focused on developing new software-defined networking products.", "Pradeep Sindhu,", "Sindhu started Juniper Networks with $2 million in seed funding, which was followed by $12 million in funding in the company's first year of operations.", "Juniper Networks had $3.8 million in annual revenue in 1998.", "Juniper Networks filed for an initial public offering in April 1999", "Juniper Networks's revenues grew 600% in 2000 to $673 million.", "By 2001, Juniper controlled one-third of the market for high-end core routers, mostly at the expense of Cisco Systems sales.", "In January 2001, Cisco introduced a suite of router products that BusinessWeek said was intended to challenge Juniper's increasing market-share.", "Juniper introduced a suite of routers for the network edge that allowed it to compete with Cisco. Juniper's edge routers had a 9% market share two months after release.", "By 2004, Juniper controlled 38% of the core router market.", "In late 2000, Juniper formed a joint venture with Ericsson to develop and market network switches for internet traffic on mobile devices,", "Juniper had rebounded by 2004, surpassing $1 billion in revenues for the first time that year", "In 2006, more than 200 US companies restated their financial results due to a series of investigations into stock backdating practices.", "In July 2008 Juniper's first CEO, Scott Kriens, became chairman and former Microsoft executive Kevin Johnson was appointed CEO.", "In 2012, Juniper laid off 5% of its staff and four of its high-ranking executives departed.", "In January 2014, hedge fund, activist investor and Juniper shareholder Elliott Associates advocated that Juniper reduce its cash reserves and cut costs,", "In May 2014, Palo Alto Networks agreed to pay a $175 million settlement for allegedly infringing on Juniper's patents for application firewalls.", "In 2015, Wired Magazine reported that the company announced it had found unauthorized code that enabled backdoors into its ScreenOS products.", "By 2001, Juniper had made only a few acquisitions of smaller companies, due to the leadership's preference for organic growth.", "Juniper made five acquisitions in 2005, mostly of startups with deal values ranging from $8.7 to $337 million. It acquired application-acceleration vendor Redline Networks, VOIP company Kagoor Networks, as well as wide area network (WAN) company Peribit Networks.", "From 2010 to September 2011, Juniper made six acquisitions and invested in eight companies. Often Juniper acquired early-stage startups, developing their technology, then selling it to pre-existing Juniper clients.", "In April 2016, Juniper closed its acquisition of BTI, a provider of cloud and metro network technology, in an effort to beef up its data center interconnect and metro packet optical transport technology and services.", "Juniper Networks designs and markets IT networking products, such as routers, switches and IT security products.", "Juniper is the third largest market-share holder overall for routers and switches used by ISPs.", "As of February 2015, Juniper's product families include the following:", "Juniper Networks' first product was the Junos router operating system, which was released on July 1, 1998.", "By 2000, Juniper had developed five hardware systems and made seven new releases of its Junos operating system.", "By 2003, Juniper had diversified into three major router applications: core routers, edge routers and routers for mobile traffic.", "Juniper's first enterprise switch product was the EX 4200, which was released in 2008. In a comparative technical test, Network World said the EX4200 was the top performer out of network switches they tested in latency and throughput, but its multicast features were \"newer and less robust\" than other aspects of the product.", "In February 2011, Juniper introduced QFabric, a proprietary protocol", "In February 2014, several software and hardware improvements were introduced for Juniper routers, including a series of software applications ISPs could use to provide internet-based services to consumers.", "Juniper Networks introduced the JProtect security toolkit in May 2003. It included firewalls, flow monitoring, filtering and Network Address Translation (NAT).", "In September 2004, Juniper entered the market for enterprise access routers with three routers that were the first of the J-series product family. It used the channel partners acquired with NetScreen to take the routers to market.", "In August 2011, Juniper and AT&T announced they would jointly develop the AT&T Mobile Security application based on Juniper's Pulse security software.", "An analysis of Juniper's ScreenOS firmware code in December 2015 discovered a backdoor key using Dual_EC_DRBG allowing to passively decrypt the traffic encrypted by ScreenOS. This backdoor was inserted in the year 2008 into the versions of ScreenOS from 6.2.0r15 to 6.2.0r18 and from 6.3.0r12 to 6.3.0r20", "In December 2015, Juniper Systems announced that they had discovered \"unauthorized code\" in the ScreenOS software that underlies their NetScreen devices, present from 2012 onwards. There were two vulnerabilities: One was a simple root password backdoor, and the other one was changing a point in Dual_EC_DRBG so that the attackers presumably had the key to use the preexisting (intentional or unintentional) kleptographic backdoor in ScreenOS to passively decrypt traffic.", "According to a 2014 SWOT analysis by MarketLine, in recent history Juniper has been focusing on software-defined networking (SDN).", "In May 2013, Juniper announced an SDN controller called JunosV Contrail, using technology it acquired through Contrail Systems.", "Every year, since 2009, Juniper holds SDN Throwdown competition to encourage students from universities across the world to access NorthStar Controller and build a solution around it to optimize network throughput. In 2019, team from Rutgers University led by PhD student, Sumit Maheshwari won this competition .", "In March 2015, Juniper announced a series of updates to the PTX family of core routers, the QFX family of switches, as well as updates to its security portfolio.", "In October 2018, Juniper announced a new offering called EngNet, which is a set of developer tools and information meant to help companies move toward automation, and replace the typical command-line interface.", "Juniper Networks has operations in more than 100 countries. Around 50% of its revenue is from the United States, 30% is from EMEA and 20% is from Asia. Juniper sells directly to businesses, as well as through resale and distribution partners, such as Ericsson, IBM, Nokia, IngramMicro and NEC.", "According to a 2013 report by Glassdoor, Juniper Networks has the highest paid software engineers in the technology sector by a margin of about $24,000 per year.", "According to a SWOT analysis by MarketLine, Juniper has \"a strong focus\" on research and development. R&D expenses have been between 22 and 25% of revenue from 2011 to 2013."]},
{"Title": "Huawei", "Organization_name": "Huawei Technologies Co., Ltd.", "Native name": "华为技术有限公司", "Type": "Limited Company", "Industry": "Mobile phones, Consumer electronics, Telecom equipment, Networking equipment", "Founded": "1987 ; 32 years ago (1987)", "Founder": "Ren Zhengfei", "Headquarters": "Shenzhen, China", "Area served": "Worldwide", "Key people": "Ren Zhengfei (Founder & CEO) Liang Hua (chairman) Meng Wanzhou (CFO)", "Products": "Mobile and fixed broadband networks consultancy and managed services multimedia technology smartphones tablet computers dongles Smart TV HarmonyOS", "Brands": "Huawei, Honor", "Revenue": "CN¥ 721.202 billion US$105.191 billion (2018)", "Operating income": "CN¥73.287 billion US$10.689 billion (2018)", "Net income": "CN¥59.345 billion US$8.656 billion (2018)", "Total assets": "CN¥665.792 billion US$97.109 billion (2018)", "Total equity": "CN¥233.065 billion US$33.994 billion (2018)", "Number of employees": "190,000 (2019)", "Parent": "Huawei Investment & Holding", "Subsidiaries": "HiSilicon", "Website": "www.huawei.com", "strings": ["Huawei Technologies Co., Ltd. (/ˈhwɑːˌweɪ/; Chinese: 华为; pinyin: Huáwéi) is a Chinese multinational technology company that provides telecommunications equipment and sells consumer electronics, including smartphones and is headquartered in Shenzhen, Guangdong.", "The company was founded in 1987 by Ren Zhengfei. Initially focused on manufacturing phone switches, Huawei has expanded its business to include building telecommunications networks, providing operational and consulting services and equipment to enterprises inside and outside of China, and manufacturing communications devices for the consumer market.", "Huawei has deployed its products and services in more than 170 countries, and as of 2011[update] it served 45 of the 50 largest telecom operators.", "Although successful internationally, Huawei has faced difficulties in some markets, due to cybersecurity allegations—primarily from the United States government—that Huawei's infrastructure equipment may enable surveillance by the Chinese government. Especially with the development of 5G wireless networks (which China has aggressively promoted), there have been calls from the U.S. to prevent the use of products by Huawei or fellow Chinese telecom ZTE by the U.S. or its allies. Huawei has argued that its products posed \"no greater cybersecurity risk\" than those of any other vendor and that there is no evidence of the U.S. espionage claims. Nonetheless, Huawei pulled out of the U.S. consumer market in 2018, after these concerns affected the ability to market their consumer products there.", "U.S. measures intensified in May 2019; in the midst of an ongoing trade war between China and the United States, Huawei was restricted from doing commerce with U.S. companies due to alleged previous willful violations of U.S. sanctions against Iran. On 29 June 2019, U.S. President Donald Trump reached an agreement to resume trade talks with China and announced that he would ease the aforementioned sanctions on Huawei.", "According to the company founder Ren Zhengfei, the name Huawei comes from a slogan he saw on a wall, Zhonghua youwei meaning \"China has promise\" (中华有为, Zhōnghuá yǒuwéi), when he was starting the company and needed a name.", "During the 1980s, the Chinese government tried to modernize the country's underdeveloped telecommunications infrastructure. A core component of the telecommunications network was telephone exchange switches, and in the late 1980s, several Chinese research groups endeavored to acquire and develop the technology, usually through joint ventures with foreign companies.", "Ren Zhengfei, a former deputy director of the People's Liberation Army engineering corps, founded Huawei in 1987 in Shenzhen. The company reports that it had RMB 21,000 in registered capital at the time of its founding.", "Ren sought to reverse engineer foreign technologies with local researchers. At a time when all of China's telecommunications technology was imported from abroad, Ren hoped to build a domestic Chinese telecommunication company that could compete with, and ultimately replace, foreign competitors.", "During its first several years the company's business model consisted mainly of reselling private branch exchange (PBX) switches imported from Hong Kong. Meanwhile, it was reverse-engineering imported switches and investing heavily in research and development to manufacture its own technologies.", "The company's first major breakthrough came in 1993 when it launched its C&C08 program controlled telephone switch. It was by far the most powerful switch available in China at the time. By initially deploying in small cities and rural areas and placing emphasis on service and customizability, the company gained market share and made its way into the mainstream market.", "Huawei also won a key contract to build the first national telecommunications network for the People's Liberation Army, a deal one employee described as \"small in terms of our overall business, but large in terms of our relationships\".", "In the 1990s Canadian telecom giant Nortel outsourced production of their entire product line to Huawei.", "Another major turning point for the company came in 1996 when the government in Beijing adopted an explicit policy of supporting domestic telecommunications manufacturers and restricting access to foreign competitors. Huawei was promoted by both the government and the military as a national champion, and established new research and development offices.", "In 1997, Huawei won a contract to provide fixed-line network products to Hong Kong company Hutchison Whampoa.", "In May 2003, Huawei partnered with 3Com on a joint venture known as H3C, which was focused on enterprise networking equipment. It marked 3Com's re-entrance into the high-end core routers and switch market, after having abandoned it in 2000 to focus on other businesses. 3Com bought out Huawei's share of the venture in 2006 for US$882 million.", "In 2005, Huawei's foreign contract orders exceeded its domestic sales for the first time. Huawei signed a Global Framework Agreement with Vodafone. This agreement marked the first time a telecommunications equipment supplier from China had received Approved Supplier status from Vodafone Global Supply Chain.", "In 2007, Huawei began a joint venture with U.S. security software vendor Symantec Corporation, known as Huawei Symantec, which aimed to provide end-to-end solutions for network data storage and security. Huawei bought out Symantec's share in the venture in 2012, with The New York Times noting that Symantec had fears that the partnership \"would prevent it from obtaining United States government classified information about cyberthreats\".", "In May 2008, Australian carrier Optus announced that it would establish a technology research facility with Huawei in Sydney.", "In July 2010, Huawei was included in the Global Fortune 500 2010 list published by the U.S. magazine Fortune for the first time, on the strength of annual sales of US$21.8 billion and net profit of US$2.67 billion.", "In October 2012, it was announced that Huawei would move its UK headquarters to Green Park, Reading, Berkshire.", "In September 2017, Huawei created a NarrowBand IOT city-aware network using a \"one network, one platform, N applications\" construction model utilising IoT, cloud computing, big data, and other next-generation information and communications technology, it also aims to be one of the world's five largest cloud players in the near future.", "In April 2019, Huawei established Huawei Malaysia Global Training Centre (MGTC) at Cyberjaya, Malaysia, which is Huawei's first training centre outside of China.", "In September 2019 Huawei filed a defamation lawsuit against a French researcher and a television show which had hosted her.", "As of the end of 2018, Huawei sold 200 million smartphones.", "Huawei announced worldwide revenues of $105.1 billion for 2018, with a net profit of $8.7 billion.", "Huawei has been at the center of espionage allegations over Chinese 5G network equipment. In 2018, the United States passed a defense funding bill that contained a passage barring the federal government from doing business with Huawei, ZTE, and several Chinese vendors of surveillance products, due to security concerns.", "On 1 December 2018, Huawei vice-chairwoman and CFO Meng Wanzhou,", "On 28 January 2019, U.S. federal prosecutors formally indicted Meng and Huawei with 13 counts of bank and wire fraud (in order to mask sale of U.S. technology in Iran that is illegal under sanctions), obstruction of justice, and misappropriating trade secrets.", "In August 2018, the National Defense Authorization Act for Fiscal Year 2019 (NDAA 2019) was signed into law, containing a provision that banned Huawei and ZTE equipment from being used by the U.S. federal government, citing security concerns.", "On 15 May 2019, the Department of Commerce added Huawei and 70 foreign subsidiaries and \"affiliates\" to its entity list under the Export Administration Regulations, citing the company having been indicted for \"knowingly and willfully causing the export, re-export, sale and supply, directly and indirectly, of goods, technology and services (banking and other financial services) from the United States to Iran and the government of Iran without obtaining a license from the Department of Treasury's Office of Foreign Assets Control (OFAC)\".", "Various U.S.-based companies immediately froze their business with Huawei to comply with the regulation,", "On 17 May 2019, Huawei voluntarily suspended its membership to JEDEC, as a temporary measure, \"until the restrictions imposed by the U.S. government are removed\".", "Kevin Wolf, an international trade lawyer and former assistant secretary of commerce for export administration during the Obama administration, argued that Huawei could not even use the open source Android Open Source Project (AOSP) code, as it could fall under U.S. trade regulations as technology of U.S. origin because Google is the majority developer.", "Google issued a statement assuring that user access to Google Play on existing Huawei devices would not be disrupted. Huawei made a similar pledge of continued support for existing devices, including security patches, but did not make any statements regarding the availability of future Android versions (such as the upcoming Android 10, previously called Android Q).", "On 22 May 2019, Arm Holdings also suspended its business with Huawei, including all \"active contracts, support entitlements, and any pending engagements\". Although it is a Japanese-owned company based in the UK, Arm cited that its intellectual property contained technologies of U.S. origin that it believed were covered under the Department of Commerce order. This prevents Huawei from manufacturing chips that use the ARM architecture.", "On 23 May 2019, it was reported that the SD Association had removed Huawei from its list of members—implicating a revocation of its membership to the association.", "On 24 May 2019, Huawei told Reuters that FedEx attempted to divert two packages sent from Japan and addressed to Huawei in China to the United States, and tried to divert two more packages sent from Vietnam to Huawei offices elsewhere in Asia, all without their authorization. At first, FedEx China claimed that \"media reports are not true\". On May 28, however, they apologized on their Chinese social media account for the fact that \"a small number of Huawei shipments were misrouted\", and claimed that \"there are no external parties that require FedEx to ship these shipments\" .", "On 29 May 2019, it was reported that Huawei was once again listed as member of JEDEC, the SD Association, and Wi-Fi Alliance.", "On 29 June 2019 at the G20 summit, Trump and Chinese president and general secretary Xi Jinping agreed to resume trade negotiations. Trump made statements implicating plans to ease the restrictions on U.S. companies doing business with Huawei, explaining that they had sold a \"tremendous amount of products\" to the company, that they \"were not exactly happy that they couldn't sell\", and that he was referring to \"equipment where there's no great national security problem with it.\" BBC News considered this move to be a \"significant concession\".", "On October 25, 2019, ARM announced that it has decided to keep supplying Huawei with its chip designs after its legal team concluded that its v8 and v9 architectures are of non-U.S. origin. That means supplying these technologies to the Chinese firm won't violate existing U.S. restrictions, ARM says.", "On November 5, 2019, US Commerce Secretary Wilbur Ross confirmed in an interview with Bloomberg that they are on phase one of a trade deal between the US and China. After this, US companies will be allowed to work with Huawei.", "During the sanctions, it was noted that Huawei had been working on its own in-house operating system codenamed \"HongMeng OS\": in an interview with Die Welt, executive Richard Yu stated that an in-house OS could be used as a \"plan B\" if it were prevented from using Android or Windows as the result of U.S. action, but that he would \"prefer to work with the ecosystems of Google and Microsoft\". Efforts to develop an in-house OS at Huawei date back as far as 2012.", "In June 2019, Huawei communications VP Andrew Williamson told Reuters that the company was testing HongMeng in China, and that it could be ready \"in months\". However, in July 2019, chairman Liang Hua and senior vice president Catherine Chen stated that Hongmeng OS was not actually intended as a mobile operating system for smartphones, and was actually an embedded operating system designed for Internet of things (IoT) hardware.", "In September 2019, Huawei began offering the Chinese Linux distribution Deepin as an optional pre-loaded operating system on selected Matebook models in China, as an alternative to Windows.", "Huawei classifies itself as a \"collective\" entity and prior to 2019 did not refer to itself as a private company. Richard McGregor, author of The Party: The Secret World of China's Communist Rulers, said that this is \"a definitional distinction that has been essential to the company's receipt of state support at crucial points in its development\".", "Ren Zhengfei is the founder and CEO of Huawei and has the power to veto any decisions made by the board of directors.", "Huawei disclosed its list of board of directors for the first time in 2010.", "Guo Ping is the Chairman of Huawei Device, Huawei's mobile phone division.", "Huawei maintains it is an employee-owned company. Ren Zhengfei retains approximately 1 percent of the shares of Huawei's holding company, Huawei Investment & Holding,", "As of the beginning of 2010[update], approximately 80% of the world's top 50 telecoms companies had worked with Huawei.", "Prominent partners include:", "Since 2016, German camera company Leica has established a partnership with Huawei, and Leica cameras will be co-engineered into Huawei smartphones, including the P and Mate Series. The first smartphone to be co-engineered with a Leica camera was the Huawei P9.", "Huawei is organized around three core business segments:", "Huawei announced its Enterprise business in January 2011 to provide network infrastructure, fixed and wireless communication, data center, and cloud computing solutions[buzzword] for global telecommunications customers.", "Huawei's core network solutions[buzzword] offer mobile and fixed softswitches, plus next-generation home location register and Internet Protocol Multimedia Subsystems (IMS). Huawei sells xDSL, passive optical network (PON) and next-generation PON (NG PON) on a single platform. The company also offers mobile infrastructure, broadband access and service provider routers and switches (SPRS). Huawei's software products include service delivery platforms (SDPs), BSSs, Rich Communication Suite and digital home and mobile office solutions[buzzword].", "Huawei Global Services provides telecommunications operators with equipment to build and operate networks as well as consulting and engineering services to improve operational efficiencies.", "Huawei's Devices division provides white-label products to content-service providers, including USB modems, wireless modems and wireless routers for mobile Wi-Fi,", "In July 2003, Huawei established their handset department and by 2004, Huawei shipped their first phone, the C300. The U626 was Huawei's first 3G phone in June 2005 and in 2006, Huawei launched the first Vodafone-branded 3G handset, the V710. The U8220 was Huawei's first Android smartphone and was unveiled in MWC 2009. At CES 2012, Huawei introduced the Ascend range starting with the Ascend P1 S. At MWC 2012, Huawei launched the Ascend D1. In September 2012, Huawei launched their first 4G ready phone, the Ascend P1 LTE. At CES 2013, Huawei launched the Ascend D2 and the Ascend Mate. At MWC 2013, the Ascend P2 was launched as the world's first LTE Cat4 smartphone. In June 2013, Huawei launched the Ascend P6 and in December 2013, Huawei introduced Honor as a subsidiary independent brand in China. At CES 2014, Huawei launched the Ascend Mate2 4G in 2014 and at MWC 2014, Huawei launched the MediaPad X1 tablet and Ascend G6 4G smartphone. Other launched in 2014 included the Ascend P7 in May 2014, the Ascend Mate7, the Ascend G7 and the Ascend P7 Sapphire Edition as China's first 4G smartphone with a sapphire screen.", "In January 2015, Huawei discontinued the \"Ascend\" brand for its flagship phones, and launched the new P series with the Huawei P8. Huawei also partnered with Google to build the Nexus 6P in 2015.", "The current models in the P and Mate lines, the Mate 30, Mate 30 Pro, Mate 30 5G, Mate 30 Pro 5G P30, P30 Pro, Mate 20, Mate 20 Pro and Mate 20 X were released in 2018 and 2019.", "Emotion UI (EMUI) is a ROM/OS developed by Huawei Technologies Co. Ltd. and based on Google's Android Open Source Project (AOSP). EMUI is pre-installed on most Huawei Smartphone devices and its subsidiaries the Honor series. The latest version of EMUI is EMUI 10.", "Huawei Technologies Co. Ltd. is the world's largest telecom equipment maker", "It has 21 R&D institutes in countries including China, the United States,", "Huawei is considering opening a new research and development (R&D) center in Russia (2019/2020), which would be the third in the country after the Moscow and St. Petersburg R&D centers. Huawei also announced plans (November 2018) to open an R&D center in the French city of Grenoble, which would be mainly focused on smartphone sensors and parallel computing software development. The new R&D team in Grenoble was expected to grow to 30 researchers by 2020, said the company. The company said that this new addition brought to five the number of its R&D teams in the country: two were located in Sophia Antipolis and Paris, researching image processing and design, while the other two existing teams were based at Huawei's facilities in Boulogne-Billancourt, working on algorithms and mobile and 5G standards. The technology giant also intended to open two new research centers in Zürich and Lausanne, Switzerland. Huawei at the time employed around 350 people in Switzerland.", "Huawei also maintains research partnerships with universities such as the University of British Columbia, the University of Waterloo, the University of Western Ontario, the University of Guelph, and Université Laval.", "Huawei has faced criticism for various aspects of its operations, with its most prominent controversies having involved U.S. allegations of its products containing backdoors for Chinese government espionage—consistent with domestic laws requiring Chinese citizens and companies to cooperate with state intelligence when warranted. Huawei executives have consistently denied these allegations, having stated that the company has never received any requests by the Chinese government to introduce backdoors in its equipment, would refuse to do so, and that Chinese law did not compel them to do so.", "Huawei has also been accused of various instances of intellectual property theft against parties such as Nortel,"]},
{"Title": "Netgear", "Organization_name": "NETGEAR, Inc.", "Type": "Public", "Traded as": "NASDAQ : NTGR S&P 600 Component", "ISIN": "US64111Q1040", "Industry": "Networking equipment", "Founded": "January 8, 1996 ; 23 years ago (1996-01-08)", "Headquarters": "San Jose, California, U.S.", "Key people": "Patrick Lo (Chairman & CEO), Bryan Murray (CFO)", "Products": "Routers, DSL/Cable Gateways, Switches, Wireless Access Points, Network Attached Storage, Security IP cameras", "Revenue": "US$ 1.41 billion (2017)", "Operating income": "US$ 86.58 million (2017)", "Net income": "US$ 19.44 million (2017)", "Total assets": "US$ 1.21 billion (2017)", "Total equity": "US$ 730.49 million (2017)", "Number of employees": "1,008 (2017)", "Website": "www.netgear.com", "strings": ["NETGEAR Inc. is a multinational computer networking company based in San Jose, California, with offices in about 25 other countries. It produces networking hardware for consumers, businesses, and service providers. The company operates in three business segments: retail, commercial, and as a service provider.", "Netgear's products cover a variety of widely used technologies such as wireless (WiFi and LTE), Ethernet and powerline, with a focus on reliability and ease-of-use. The products include wired and wireless devices for broadband access and network connectivity, and are available in multiple configurations to address the needs of the end-users in each geographic region and sector in which the company's products are sold.", "Netgear products are sold in approximately 30,000 retail locations around the globe, and through approximately 25,000 value-added resellers, as well as multiple major cable, mobile and wireline service providers around the world.", "Netgear's focus is primarily on the networking market, with products for home and business use, including wired and wireless technology.", "Netgear markets network products for the business sector, most notably the ProSAFE switch range. As of May 2007[update], Netgear provides limited lifetime warranties for ProSAFE products for as long as the original buyer owns the product. Currently focusing on Multimedia segment.", "Netgear also markets network appliances for the business sector, including managed switches and wired and wireless VPN firewalls. In 2016, Netgear released its Orbi mesh Wi-Fi System, with models for business as well as household use. The system uses a Tri-band architecture, similar to the traditional dual-band, but with a dedicated 5 GHz connection between the router and a provided satellite. The addition of a second 5 GHz channel allows the network to distribute its traffic, easing congestion caused by the increasing number of 5 GHz compatible wireless devices present in many household networks.", "Netgear sells premium NAS devices to small businesses and consumers under the product name ReadyNAS. With this storage hardware line, Netgear vies with competitors like Buffalo, Zyxel and HP. Netgear entered the storage market in May 2007 when it acquired Infrant (originator of the ReadyNAS line).", "Netgear created home security camera brand Arlo, which was spun out into a separate company in August 2018.", "Netgear outsources all manufacturing to other electronics companies, including Askey Computer Corporation, Cameo Communications, Delta Networks, Flex, Foxconn, Taicang T&W Electronics, Pegatron Corporation, SerComm, Wistron Neweb Corporation and USI Electronics (Shenzhen).", "Manufacturing occurs primarily in mainland China and Vietnam, with pilot and low-volume manufacturing in Taiwan on a select basis.", "To maintain quality standards, Netgear have established their own product quality organization based in Hong Kong and mainland China. They are responsible for auditing and inspecting process and product quality on the premises of ODMs and JDMs (Joint Development Manufacturers).", "Various Netgear products that were manufactured by SerComm were found to contain a backdoor that allowed unauthorized remote access to the affected devices.", "A backdoor also existed on the DG834 series. Any person who can access the router using a web browser, can enable \"debug\" mode using [IP_ADDR]/setup.cgi?todo=debug and then connect via Telnet directly to the router's embedded Linux system as 'root', which gives unfettered access to the router's operating system via its Busybox functionality. /setup.cgi?todo=ping_test also allows unfettered access (on a v5 model a username and password are requested). There is no user option provided to disable this. On default Netgear firmware Telnet access lacks password or other control; on ISP modified versions (such as Sky) a Telnet password exists based on the MAC address which can be found via online websites.", "In January 2017, various Netgear products were found to be vulnerable to an exploit that allows third-party access to the router and the internal network and to turn the router into a botnet."]},
{"Title": "Cumulus Networks", "Organization_name": "Cumulus Networks", "Type": "Private company", "Industry": "Networking software, Cloud Networking", "Founded": "January 2010", "Headquarters": "Mountain View, California, USA", "Key people": "Josh Leslie, CEO, JR Rivers, Co-Founder, Nolan Leake, Co-Founder", "Products": "Operating System for Switches", "Website": "www.cumulusnetworks.com", "strings": ["Cumulus Networks is a computer software company headquartered in Mountain View, California, USA. The company designs and sells a Linux operating system for industry standard network switches to deliver networking solutions[buzzword] for large datacenter, cloud computing, and enterprise environments.", "Cumulus Networks was founded by JR Rivers and Nolan Leake in 2010. The company raised a first round of seed funding in 2012.", "In 2014 Dell made a deal with Cumulus to offer the option of the Cumulus Linux network OS with their switches.", "In 2015, Hewlett Packard Enterprise made a deal with Cumulus Networks to offer Cumulus Linux on their Altoline switches.", "In 2016, Mellanox made a deal with Cumulus Networks to offer Cumulus Linux on their Spectrum switches.", "In 2018, Lenovo made a deal with Cumulus networks to offer Cumulus Linux on their ThinkSystem Rackswitch", "On June 20th, 2019, the company announced the departure of co-founder JR Rivers, who had been the original CEO and, since March 2016, the CTO. According to the company's website, neither Rivers nor Leake remain on the Board of Directors.", "Cumulus Linux is an open source Linux based networking operating system for bare metal switches. It is based on Debian.", "NetQ is a fabric-wide telemetry-based validation system that enables organizations to validate network state, both during regular operations and for post-mortem diagnostic analysis.", "Host Pack includes software essentials that brings the host to the network through NetQ and FRRouting. Host Pack focuses on trying to enhance network visibility through NetQ’s end-to-end fabric validation, and on trying to promote network connectivity through FRRouting’s open source routing protocol. It enables the host to be part of the layer 3 network, while supporting layer 2 overlay networks.", "In 2012 Cumulus initiated the open network install environment project. The Open Compute Project turned ONIE into an initiative to define an open source install environment for bare metal network switches. A network switch with a ONIE install environment gives data centers the choice of network operating system. Therefore ONIE allows for a business model where networking hardware is disaggregated from the operating system. The Cumulus Linux operating system can be installed on all ONIE compliant switches, such as the Lenovo ThinkSystem RackSwitch series."]},
{"Title": "Allied Telesis", "Organization_name": "Allied Telesis Holdings K.K.", "Native name": "アライドテレシス株式会社", "Type": "Public (K.K)", "Traded as": "TYO : 6835", "ISIN": "JP3124900006", "Industry": "Networking hardware", "Founded": "March 1987, 09 ; 32 years ago (09-03-1987)", "Headquarters": "Nishi-Gotanda, Shinagawa-ku, Tokyo 141-0031, Japan", "Area served": "Worldwide", "Key people": "Takayoshi Oshima (Chairman and CEO)", "Products": "Switches, Routers, Firewalls", "Revenue": "JPY 28.39 billion (FY 2018) (US$ 262 million) (FY 2017)", "Net income": "JPY 211 million (FY 2017) (US$ 1.9 million) (FY 2017)", "Number of employees": "1,621 (consolidated, as of December 31, 2017)", "Website": "Official website", "strings": ["Allied Telesis (アライドテレシス, Araido Tereshisu) is a network infrastructure/telecommunications company, formerly Allied Telesyn. Headquartered in Japan, their North American headquarters are in San Jose, California. Founded in 1987, the company is a global provider of secure Ethernet & IP access solutions and an industry leader in the deployment of IP triple play networks over copper and fiber access infrastructure.", "According to a Dell Oro Group report, Allied Telesis ranked 4th in the world for shipments of fast Ethernet ports in Q4 2005.", "Allied Telesis is primarily a provider of equipment for enterprise customers, along with educational and government segments. They also serve moderate and small businesses. Their POTS-to-10G iMAP (integrated Multiservice Access Platform) and iMG (intelligent Multiservice Gateways), in conjunction with advanced switching, secure VPN routing solutions, enable public and private network operators and service providers of all sizes to deploy scalable, carrier-grade networks for the cost-effective delivery of packet-based voice, video and data services.", "The current product range includes:"]},
{"Title": "NEC", "Organization_name": "NEC Corporation", "Native name": "日本電気株式会社", "Romanized name": "Nippon Denki kabushiki gaisha", "Type": "Public KK", "Traded as": "TYO : 6701", "ISIN": "JP3733000008", "Industry": "Information technology, Electronics", "Founded": "July 17, 1899 ; 120 years ago (1899-07-17) Tokyo, Japan", "Headquarters": "5-7-2, Shiba, Minato, Tokyo, Japan", "Area served": "Worldwide", "Key people": "Nobuhiro Endo (Chairman), Takashi Niino (President)", "Products": "Telecommunications equipment, Servers, Consumer electronics, Domestic appliances, Lighting", "Revenue": "¥ 2.91 trillion (2019)", "Operating income": "¥58.5 billion (2019)", "Net income": "¥40.2 billion (2019)", "Total assets": "¥2.95 trillion (2019)", "Total equity": "¥1.06 trillion (2019)", "Owner": "Sumitomo Group", "Number of employees": "109,390 (2019)", "Subsidiaries": "NEC Corporation of America, NEC Europe", "Website": "www.nec.com", "strings": ["NEC Corporation (日本電気株式会社, Nippon Denki Kabushiki-gaisha) is a Japanese multinational information technology and electronics company, headquartered in Minato, Tokyo, Japan. to business enterprises, communications services providers and to government agencies, and has also been the biggest PC vendor in Japan since the 1980s with the PC-8000 series.", "NEC was the world's fourth largest PC manufacturer by 1990. NEC has spun off its semiconductor business to Renesas Electronics and Elpida Memory.", "NEC was #463 on the 2017 Fortune 500 list. NEC is a member of the Sumitomo Group.", "Kunihiko Iwadare and Takeshiro Maeda established Nippon Electric Limited Partnership on August 31, 1898 by using facilities that they had bought from Miyoshi Electrical Manufacturing Company. Iwadare acted as the representative partner; Maeda handled company sales. Western Electric, which had an interest in the Japanese phone market, was represented by Walter Tenney Carleton.", "The company started with the production, sales and maintenance of telephones and switches. NEC modernized the production facilities with the construction of the Mita Plant in 1901 at Mita Shikokumachi. It was completed in December 1902.", "The Japanese Ministry of Communications adopted a new technology in 1903: the common battery switchboard supplied by NEC. The common battery switchboards powered the subscriber phone, eliminating the need for a permanent magnet generator in each subscriber's phone. The switchboards were initially imported, but were manufactured locally by 1909.", "NEC started exporting telephone sets to China in 1904. In 1905, Iwadare visited Western Electric in the U.S. to see their management and production control. On his return to Japan he discontinued the \"oyakata\" system of sub-contracting and replaced it with a new system where managers and employees were all direct employees of the company. Inefficiency was also removed from the production process. The company paid higher salaries with incentives for efficiency. New accounting and cost controls were put in place, and time clocks installed.", "Between 1899 and 1907 the number of telephone subscribers in Japan rose from 35,000 to 95,000. NEC entered the China market in 1908 with the implementation of the telegraph treaty between Japan and China. They also entered the Korean market, setting up an office in Seoul in January 1908. During the period of 1907 to 1912 sales rose from 1.6 million yen to 2 million yen. The expansion of the Japanese phone service had been a key part of NEC's success during this period. This expansion was about to take a pause.", "The Ministry of Communications delayed a third expansion plan of the phone service in March, 1913, despite having 120,000 potential telephone-subscribers waiting for phone installations. NEC sales fell sixty percent between 1912 and 1915. During the interim, Iwadare started importing appliances, including electric fans, kitchen appliances, washing machines and vacuum cleaners. Electric fans had never been seen in Japan before. The imports were intended to prop up company sales. In 1916, the government resumed the delayed telephone-expansion plan, adding 75,000 subscribers and 326,000 kilometers of new toll lines. Thanks to this third expansion plan, NEC expanded at a time when much of the rest of Japanese industry contracted.", "In 1919, NEC started its first association with Sumitomo, engaging Sumitomo Densen Seizosho to manufacture cables. As part of the venture, NEC provided cable manufacturing equipment to Sumitomo Densen. Rights to Western Electrics duplex cable patents were also transferred to Sumitomo Densen.", "The Great Kantō earthquake struck Japan in 1923. 140,000 people were killed and 3.4 million were left homeless. The first automatic switching systems were the Strowger-type model made by Automatic Telephone Manufacturing Co. (ATM) in the United Kingdom. NEC participated in the installation of the automatic switching systems, ultimately becoming the general sales agent for ATM. NEC developed its own Strowger-type automatic switching system in 1924, a first in Japan. One of the plants almost leveled during the Kanto earthquake, the Mita Plant, was chosen to support expanding production. A new three-story steel-reinforced concrete building was built, starting in 1925. It was modeled after the Western Electric Hawthorne Works.", "NEC started its radio communications business in 1924. Japan's first radio broadcaster, Radio Tokyo was founded in 1924 and started broadcasting in 1925. NEC imported the broadcasting equipment from Western Electric. The expansion of radio broadcasting into Osaka and Nagoya marked the emergence of radio as an Industry. NEC established a radio research unit in 1924. NEC started developing electron tubes in 1925. By 1930, they were manufacturing their first 500 W radio transmitter. They provided the Chinese Xinjing station with a 100 kW radio broadcasting system in 1934.", "Photo-telegraphic equipment developed by NEC transmitted photos of the accession ceremony of Emperor Hirohito. The ceremony was held in Kyoto in 1928. The Newspapers Asahi Shimbun and Mainichi Shimbun were competing to cover the ceremony. The Asahi Shimbun was using a Siemens device. The Mainichi was planning to use French photo-telegraphic equipment. In the end, both papers acquired and used the NEC product, due to its faster transmission rate and higher picture quality.", "In 1929 Nippon Electric provided Japan's Ministry of Communications with the A-type switching system, the first of these systems to be developed in Japan. Nippon supplied Japan's Ministry of Communications with nonloaded line carrier equipment for long distance telephone channels in 1937.", "World War II was described by the company as being the blackest days of its history. The Ueno plant was leveled by military attack in March 1945. Fire bombings in April and May heavily damaged the Tamagawa Plant, reducing its capacity by forty percent. The Okayama Plant was totally destroyed by a bombing attack in June of the same year. At the end of the war, NEC's production had been substantially reduced by damage to its facilities, and by material and personnel shortages.", "After the war, production was slowly returned to civilian use. NEC re-opened its major plants by the end of January 1946. Nippon Electric New York (now NEC America Inc.) was incorporated in the same year.", "NEC supplied KDD with submarine cable systems for laying in the Pacific Ocean in 1964. They supplied short-haul 24 channel PCM carrier transmission equipment to NTT in 1965. NEC de Mexico, S. A. de C. V., NEC do Brasil, S. A., NEC Australia Pty. Ltd. were established between 1968 and 1969. NEC supplied Comsat Corporation with the SPADE satellite communications system in 1971. In 1972, Switzerland ordered a NEC satellite communications earth station. The same year, a small transportable satellite communications earth station was set up in China. Shares of NEC common stock were listed on the Amsterdam Stock Exchange in 1973. NEC also designed an automated broadcasting system for the Japan Broadcasting Corporation the same year. NEC Electronics (Europe) GmbH was also established. In 1974, the ACOS series computer was introduced. The New Central Research Laboratories were completed in 1975. In 1977, Japan's National Space Development Agency launched the NEC geostationary meteorological satellite, named Himawari.", "During this period NEC introduced the concept of \"C&C\", the integration of computers and communications. NEC America Inc. opened a plant in Dallas, Texas to manufacture PABX and telephone systems in 1978. They also acquired Electronic Arrays, Inc. of California the same year to start semiconductor chip production in the United States.", "In 1980, NEC created the first digital signal processor, the NEC μPD7710. NEC Semiconductors (UK) Ltd. was established in 1981, producing VLSIs and LSIs. NEC introduced the 8-bit PC-8800 series personal computer in 1981, followed by the 16-bit PC-9800 series in 1982. In 1983 NEC stock was listed on the Basel, Geneva and Zurich, Switzerland exchanges. NEC quickly became the dominant leader of the Japanese PC industry, holding 80% market share. NEC USA, Inc. was established in 1989 as a holding company for North American operations.", "In 1983, NEC Brasil (pt), the Brazilian subsidiary of NEC, was forced to nationalise its corporate stock under orders of the Brazilian military government, whereby shareholder control of NEC Brasil was ceded to the private equity group Brasilinvest of Brazilian investment banker Mário Garnero. Since NEC Brasil's foundation in 1968, it had become the major supplier of telecommunications equipment to the Brazilian government.", "In 1990, the new head office building, known as the \"Super Tower\", was completed in Shiba, Tokyo. Additionally, joint-venture agreements were established to manufacture and market digital electronic switching systems and LSIs in China. In 1993 NEC's asynchronous transfer mode (ATM) switching system, the NEAX61 (Nippon Electronic Automatic Exchange) ATM Service Node, went into service in the United States. NEC Europe, Ltd. was established as a holding company for European operations the same year. The NEC C&C Research Laboratories, NEC Europe, Ltd. were opened in Germany in 1994. NEC (China) Co, Ltd. was established as a holding company for Chinese operations in 1996. In 1997 NEC developed 4Gbit DRAM, and their semiconductor group was honored with one of the first Japan Quality Awards. In 1998, NEC opened the world's most advanced semiconductor R&D facility.", "NEC had been the no. 1 personal computer vendor in Japan during the 1980s, but it faced increasing competition from Fujitsu, Seiko Epson and IBM Japan. Nevertheless, by the early 1990s NEC was still the largest, having well over 50% market share in the Japanese market. Competition heated up later as rival Fujitsu started to aggressively market its computers, which were industry standard (x86) instead of NEC's indigenous models. By 1997 NEC's share was reduced to about 35%.", "NEC celebrated their 100th anniversary in 1999. In 2000, NEC had formed a joint venture manufacturing OLED displays with Samsung SDI, which had also been a NEC-Samsung JV.", "NEC Electronics Corporation was separated from NEC in 2002 as a new semiconductor company. NEC Laboratories America, Inc. (NEC Labs) started in November, 2002 as a merger of NEC Research Institute (NECI) and NEC USA's Computer and Communications Research Laboratory (CCRL). NEC built the Earth Simulator Computer (ESC), the fastest supercomputer in the world from 2002 to 2004, and since produced the NEC N343i in 2006.", "In 2003 NEC had a 20.8% market share in the personal computer market in Japan, slightly ahead of Fujitsu.", "In 2004, NEC has abandoned not only the OLED business but the emerging displays business as a whole, by selling off its Plasma display business and exiting from the JV with Samsung SDI.", "In 2007, NEC and Nissan Co. Corp. started evaluating a joint venture to produce lithium ion batteries for hybrid and electric cars. They established Automotive Energy Supply Corporation as a result.", "On April 23, 2009, Renesas Technology Corp and NEC Electronics Corp struck a basic agreement to merge by around April 2010.", "On January 27, 2011, NEC formed a PC joint venture with Chinese PC maker Lenovo, the fourth largest PC maker in the world. As part of the deal, the companies said in a statement they will establish a new company called Lenovo NEC Holdings B.V., which will be registered in the Netherlands. NEC will receive US$175 million from Lenovo through the issuance of Lenovo's shares. Lenovo, through a unit, will own a 51% stake in the joint venture, while NEC will hold a 49% stake.", "On January 26, 2012 NEC Corporation announced that it would cut 10,000 jobs globally due to big loss on NEC's consolidated financial statement in line with economic crisis in Europe and lagged in the development of smartphones in the domestic market compare to Apple and Samsung. Previously, in January 2009 NEC has cut about 20,000 jobs, mainly in sluggish semiconductor and liquid crystal display related businesses.", "In 2013 NEC was the biggest PC server manufacturer in Japan, with a 23.6% share.", "In April 2017, KEMET Corporation will purchase a 61% controlling interest in NEC Tokin from NEC, making NEC Tokin its wholly owned subsidiary. Once the purchase is complete, the company will change its name to \"Tokin Corporation\".", "In August 2018, Envision Energy struck an agreement with Nissan and NEC to acquire their automotive battery joint venture.", "As of September 2019, NEC was the largest non-Chinese supplier of AI surveillance technology in the world.", "As of July 2018, NEC has 6 larger business segments - Public, Enterprise, Network Services, System Platform, Global, Others. It has renamed its Telecom Carrier business to Network Service.", "Principal subsidiaries of NEC include:", "Defense products include:", "Achievements of NEC include:[citation needed]", "As of 2009[update] NEC ranked consistently in the top four companies over the previous five years for the number of U.S. patents issued, averaging 1764 each year[citation needed].", "NEC was the main (title) sponsor of the Davis Cup competition until 2002, when BNP Paribas took over the sponsorship.", "NEC between 1982 and 2012 sponsored the NEC Cup, a Go tournament in Japan.", "NEC between 1986 and 2003 sponsored the NEC Shun-Ei, a Go tournament for young players in Japan.", "NEC sponsored the English football club Everton from 1985 to 1995. The 1995 FA Cup Final triumph was Everton's final game of the decade-long NEC sponsorship, and Danka took over as sponsors.", "NEC signed a deal to sponsor the Sauber F1 Team from the 2011 season until the 2014 season.", "NEC signed a new deal to sponsor the Sahara Force India F1 Team for the 2015 season.", "In April 2013, NEC became the umbrella sponsor for PGA Tour Latinoamérica, a third-tier men's professional golf tour.", "NEC one sponsored the V.League Volleyball.", "These started as works teams, but over the years came to include professional players:", "NEC also used to own Montedio Yamagata of the football (soccer) J. League, but as of 2009[update] just sponsors them along with other local companies."]},
{"Title": "Mellanox Technologies", "Organization_name": "Mellanox Technologies Ltd.", "Type": "Public", "Traded as": "NASDAQ : MLNX", "Industry": "Communication equipment", "Successor": "NVIDIA", "Founded": "1999 ; 20 years ago (1999) in Yokneam Illit, Israel", "Founders": "Eyal Waldman, Shai Cohen, Roni Ashuri, Michael Kagan, Evelyn Landman, Shimon Rottenberg, Eitan Zahavi, Udi Katz, Alon Webman", "Headquarters": "Sunnyvale, California, U.S.", "Key people": "Eyal Waldman, CEO", "Products": "Ethernet and InfiniBand switches host bus adapters", "Revenue": "US$ 863,9 Million (FY17) US$ 658,1 Million (FY15) US$ 463.6 Million (FY14)", "Operating income": "US$ 118.31 Million (FY12)", "Net income": "US$ 111.38 Million (FY12)", "Number of employees": "2900 (March 2017)", "Website": "www.mellanox.com", "strings": ["Mellanox Technologies Ltd. (Hebrew: מלאנוקס טכנולוגיות בע\"מ‎) is an Israeli and American multinational supplier of computer networking products using InfiniBand and Ethernet technology. Mellanox offers adapters, switches, software, cables and silicon for markets including high-performance computing, company data centers, cloud computing, computer data storage and financial services.[citation needed]", "On March 11, 2019, Nvidia announced its intent to acquire the company for $6.9 billion.", "Mellanox was founded in 1999 by former Israeli executives of Intel Corporation and Galileo Technology (which was acquired by Marvell Technology Group in October 2000 for $2.8 billion", "The company went public in 2007, with an initial public offering on NASDAQ that raised $102 million, and valued the company at over half a billion dollars.", "In 2010, Oracle Corporation became a major investor in the company, holding around 10% of its stock.", "In February 2011, Mellanox acquired Voltaire Ltd., a provider of data center switches for about $218 million.", "In 2016, Mellanox Technologies began to employ programmers in the Gaza Strip, in addition to its team of Israeli Arab programmers and programmers in Ramallah and Nablus.", "In 2019 Mellanox was acquired for $ 6.9 billion by Nvidia Corporation and it is a definite contender for the largest M&A deal in 2019.", "The activist investor Starboard Value LP purchased a 10.7% stake in the company in November 2017.", "In a \"board battle,\"", "In 2013 Mellanox acquired certain assets of XLoom Communications Ltd., including opto-electric chip-scale packaging, as well as hired XLoom's technology personnel.[citation needed] In July 2013, Mellanox acquired privately held Kotura, Inc., a developer of silicon photonics optical interconnect technology for high-speed networking.", "In July 2014, Mellanox acquired privately held Integrity Project, for its software connectivity, low-level development, real-time applications and security technology.", "Mellanox is a fabless semiconductor company.", "Mellanox Technologies provides InfiniBand and Ethernet network adapters and switches for servers and storage used in enterprise data centers", "In 2010, a press release from Oracle described Mellanox as \"the premier switched fabric provider for enterprise data centers and high performance computing\". According to the same press release, Mellanox's InfiniBand technology is faster, more scalable and provides higher throughput than alternative communications technologies.", "Mellanox network adapter and switch ASICs utilize RDMA/RoCE technology.", "ConnectX-4 and ConnectX-5 adapters have enhanced capabilities such as higher speeds (up to 100Gb per second) and Multi-Host support.", "Mellanox Technologies' InfiniBand products for computer clusters have been deployed in many of the TOP500 list of high-performance computers.", "Mellanox also promotes its products for storage area networks.[citation needed]", "In addition to its global headquarters in the US, Mellanox has offices in Israel, Denmark, China, Russia, Singapore, Taiwan, Japan and the United Kingdom.", "As of 2011[update] Mellanox derived more than a quarter of its revenues from two large customers, Hewlett-Packard and IBM.", "Mellanox outsourced some of its engineering to the West Bank. Rather than setting up offshore engineering centers in the Far East or Eastern Europe, Mellanox hired Palestinian engineers from Ramallah through a Palestinian outsourcing firm.", "Waldman had previously talked about Mellanox's plans to build a research and development center in Ramallah, even though it is more expensive than outsourcing to Eastern Europe."]},
{"Title": "Dell EMC", "Organization_name": "Dell EMC", "Type": "Subsidiary", "Traded as": "NYSE : EMC (1986–2016)", "ISIN": "US2686481027", "Industry": "Computer storage", "Predecessor": "Data General, nLayers, Netwitness", "Founded": "1979 ; 40 years ago (1979)", "Founders": "Richard Egan, Roger Marino, John Curly", "Headquarters": "Hopkinton, Massachusetts Round Rock, Texas, U.S.", "Area served": "Worldwide", "Key people": "David Goulden (President, Infrastructure Solutions Group, Dell EMC)", "Products": "See EMC products", "Parent": "Dell Technologies", "Website": "www.dellemc.com", "strings": ["Dell EMC (until 2016, EMC Corporation) is an American multinational corporation headquartered in Hopkinton, Massachusetts and Round Rock, Texas, United States. and was also listed on the S&P 500 index.", "EMC was acquired by Dell in 2016; at that time, Forbes noted EMC's \"focus on developing and selling data storage and data management hardware and software and convincing its customers to buy its products independent of their other IT buying decisions\" based on \"best-of-breed.\" It was later renamed to Dell EMC.", "Dell uses the EMC name with some of its products.", "EMC, founded in 1979 by Richard Egan, Roger Marino & John Curly (the E, M & C in EMC),", "Michael Ruettgers joined EMC in 1988 and served as CEO from 1992 until January 2001.", "Some of EMC's growth was via acquisitions of small companies.", "On October 12, 2015, Dell Inc. announced its intent to acquire EMC in a cash-and-stock deal valued at $67 billion, which has been considered the largest-ever acquisition in the technology sector. This would combine Dell's enterprise server, personal computer, and mobile businesses with EMC's enterprise storage business. Dell would pay $24.05 per share of EMC, and $9.05 per share of tracking stock in VMware.", "On September 7, 2016, Dell Inc. completed the merger with EMC Corp., which involved the issuance of $45.9 billion in debt and $4.4 billion common stock.", "In addition to those of the majority-owned Pivotal company, Dell EMC sells products and services, including products from other Dell Technologies companies, designed to allow IT departments to move to a cloud computing model and to analyze big data.", "The following table includes the listing and timeline of EMC Corporation's major acquisitions of other companies since 1996.", "In 2012, EMC sponsored The Human Face of Big Data,"]},
{"Title": "ZTE", "Organization_name": "ZTE Corporation", "Formerly": "Zhongxing Telecommunication Equipment Corporation", "Type": "Public", "Traded as": "SZSE : 000063 SEHK : 763", "ISIN": "CNE000000TK5 CNE1000004Y2", "Industry": "Telecommunications equipment Networking equipment", "Founded": "1985 ; 34 years ago (1985) (as Zhongxing Semiconductor Co., Ltd.)", "Founder": "Hou Weigui (Chinese : 侯為貴 ; pinyin : Hóu Wéiguì)", "Headquarters": "55 Hi-tech Road South Shenzhen, Guangdong, China 518057", "Area served": "Worldwide", "Key people": "Yin Yimin (Chairman) Zhao Xianming (President and Executive Director)", "Products": "Mobile phones, smartphones, tablet computers, hardware, software and services to telecommunications service providers and enterprises", "Revenue": "CN¥ 85.513 billion (2018)", "Operating income": "CN¥-612 million (2018)", "Net income": "CN¥-7.35 billion (2018)", "Total assets": "CN¥129.350 billion (2018)", "Total equity": "CN¥22.897 billion (2018)", "Owner": "Zhongxingxin (30.34%)", "Number of employees": "74,773 (2017)", "Subsidiaries": "Nubia Technology (49.9%) ZTEsoft Zonergy", "Website": "zte.com.cnztedevice.com", "strings": ["ZTE Corporation is a Chinese multinational telecommunications equipment and systems company headquartered in Shenzhen, Guangdong, China. It is one of China's leading telecom equipment manufacturers.", "ZTE operates in three business units: carrier networks (54%), terminals (29%) and telecommunication (17%), their core products being wireless, exchange, access, optical transmission, and data telecommunications gear; mobile phones; and telecommunications software.", "It also offers products that provide value-added services,", "As with Huawei, the company has faced criticism in the United States over potential ties to the Chinese government that could enable surveillance. In 2017, ZTE was fined for illegally exporting U.S. technology to Iran and North Korea in violations of economic sanctions. In April 2018, after the company failed to properly reprimand the employees involved, the U.S. Department of Commerce banned U.S. companies (semiconductors) from exporting to ZTE for seven years. The ban was lifted in July 2018 after ZTE replaced its senior management, and agreed to pay additional fines and establish an internal compliance team for 10 years.", "ZTE, initially founded as Zhongxing Semiconductor Co., Ltd in Shenzhen, Guangdong province, in 1985, was incorporated by a group of investors associated with China's Ministry of Aerospace Industry.", "While the company initially profited from domestic sales,", "By 2009, the company had become the third-largest vendor of GSM telecom equipment worldwide, and about 20% of all GSM gear sold throughout the world that year was ZTE branded.", "In March 2017, ZTE pleaded guilty to illegally exporting U.S. technology to Iran and North Korea in violation of trade sanctions, and was fined a total of US$1.19 billion by the U.S. Department of Commerce. It was the largest-ever U.S. fine for export control violations.", "ZTE was allowed to continue working with U.S. companies, provided that it properly reprimand all employees involved in the violations. However, the Department of Commerce found that ZTE had violated these terms and made false statements regarding its compliance, having fired only 4 senior officials and still providing bonuses to 35 other employees involved in the violations. On 16 April 2018, the Department of Commerce banned U.S. companies from providing exports to ZTE for seven years.", "On 9 May 2018, ZTE announced that, although it was \"actively communicating with the relevant U.S. government departments\" to reverse the export ban, it had suspended its \"major operating activities\" (including manufacturing) and trading of its shares.", "Later that month, the U.S. Senate passed a version of the National Defense Authorization Act for Fiscal Year 2019 that blocked the settlement, and banned the federal government from purchasing equipment from Huawei and ZTE (citing them as national security risks due to risks of Chinese government surveillance). The settlement was criticized by Senators as being \"personal favours\" between Trump and the Chinese government, as the Chinese government issued a loan for an Indonesian theme park project with a Trump golf course following the May 2018 announcement.", "On 13 July 2018, the denial order was officially lifted.", "In January 2019, it became public that ZTE has retained the services of former senator Joe Lieberman as a lobbyist.", "ZTE has several international subsidiaries.", "As a subsidiary of ZTE Corporation, ZTEsoft engages in ICT industry and specializes in providing BSS/OSS, big data products and services to telecom operators, and ICT, smart city and industry products and services to enterprises and governments.", "Nubia Technology was a fully owned subsidiary of ZTE Corporation. The company has subsequently disposed of the majority of its equity in the company. In 2017 it reduced its stake to 49.9%.", "PT ZTE Indonesia were representative of ZTE with has many customer with PT Telkom Indonesia tbk, PT Telekomunikasi Seluler tbk, PT Indosat tbk, PT Smartfren tbk, PT XL Axiata, and also supply hand held with ZTE Trademarks.", "ZTE entered the Australian market in 2005, acts as the exclusive supplier of ZTE handsets, network cards, and as OEM Supplier to customers, such as Telstra, and Optus in Australia.", "ZTE Deutschland GmbH was founded in 2005 with headquarters in Düsseldorf. As of 2008, it had hired 50 people, 60% of whom were recruited locally.", "A North American subsidiary of ZTE,", "ZTE Telecom India Private Limited provides distribution of telecom equipment and systems. The company also provides repair, support, and maintenance services for its telecom equipment. ZTE Telecom India Private Limited was formerly known as ZTE Kangxun Telecom Company India Private Limited. The company was founded in 2003 and is based in tirupati, India.", "ZTE (Hong Kong) Ltd. (China) serves in such areas as global contract manufacturing.", "ZTE do Brasil Ltda. was founded in 2002 with headquarters in São Paulo and offices in Rio de Janeiro and Brasília; providing mobile devices and network products for the Brazilian market.", "ZTE Myanmar is also a fully owned subsidiary of ZTE Corporation.", "Zonergy is a renewables company with interests in electricity generation through solar parks in China and Pakistan and palm oil cultivation in Indonesia to produce biofuels. ZTE is a major shareholder and was instrumental in the creation of the company in 2007 but holds a minority of the shares in the entity.", "As a subsidiary of ZTE Corporation, ZTEsoft India engages in ICT industry and specializes in providing BSS/OSS, big data products and services to telecom operators, and ICT, smart city solutions and industry products and services to enterprises and governments.Company has several tie-ups with regional governments for implementation of smart city solutions.", "As a subsidiary of ZTE Corporation, ZTEsoft Singapore engages in ICT industry and specializes in providing BSS/OSS, big data products and services to telecom operators, and ICT, smart city solutions and industry products and services to enterprises and governments.", "ZTE Romania, headquartered in Bucharest, is a fully owned subsidiary of ZTE Corporation.", "ZTE operates in three business segments – Carrier Networks(~54%)-Terminals(~29%)-Telecommunication(~17%)Products can be roughly arranged into three categories: equipment used by network operators (links and nodes, etc.), equipment used to access networks (terminals), and services, which includes software.", "As of 2012, ZTE is the 4th largest mobile phone vendor.", "In November 2017, ZTE announced the Axon M.", "In 2019 was announced the ZTE AXON S, a brand new concept of smartphone with no holes or apertures thanks to a lateral slider.", "The MF60 and MF80 4G mobile hotspots were announced in August 2011.", "At Mobile World Congress 2014 in Spain, Microsoft announced that ZTE is the latest hardware partner of Windows Phone platform.", "ZTE is also a provider of Core Routing and Core Network equipment, also known as Network Elements such as:", "A good number of ZTE's customers are outside of China. During the 2000s, the majority were developing country mobile network operators, but ZTE products see use in developed countries as well. The UK's Vodafone, Canadian Telus, Australia's Telstra, as well as France Telecom have all purchased equipment from ZTE.", "Many Chinese companies are also ZTE customers, including China Netcom,", "ZTE began to release smartphones in the United States in 2011. The company elected to focus its efforts on low-cost products for discount and prepaid wireless carriers, including devices with premium features typically associated with high-end products, such as large high-resolution screens and fingerprint readers.", "In May 2016, ZTE became the co-sponsor of German club Borussia Mönchengladbach.", "Since 2015, taking advantage of the league's appeal in China, several U.S. National Basketball Association teams have had sponsorship deals with ZTE, including the Houston Rockets (based in the home city of ZTE's U.S. subsidiary), Golden State Warriors, and New York Knicks.", "Norwegian telecommunications giant Telenor, one of the world's largest mobile operators, banned ZTE from \"participating in tenders and new business opportunities for 6 months because of an alleged breach of its code of conduct in a procurement proceeding\" during a five-month time span ending in March 2009.", "Contract negotiations to build a broadband network for the Philippine government may have included improper activities.", "In December 2010, ZTE sold systems for eavesdropping on phone and Internet communications to the government-controlled Telecommunication Company of Iran. This system may help Iran monitor and track political dissidents.", "At least one ZTE mobile phone (sold as the ZTE Score in the United States by Cricket and MetroPCS) can be remotely accessed by anyone with an easily obtained password.", "ZTE, as well as Huawei, has faced scrutiny by the U.S. federal government over allegations that Chinese government surveillance could be performed through its handsets and infrastructure equipment.", "As of June 30, 2019[update], Zhongxing Xin (Chinese: 中興新; literally: 'Zhongxing New'; aka ZTE Holdings), an intermediate holding company, owned 27.40% stake of ZTE.", "The shareholders of ZTE Holdings were Xi'an Microelectronics (Chinese: 西安微电子技术研究所; a subsidiary of China Academy of Aerospace Electronics Technology) for 34%, Aerospace Guangyu (Chinese: 深圳航天广宇工业有限公司; a subsidiary of CASIC Shenzhen Group) for 14.5%, Zhongxing WXT (Chinese: 深圳市中兴维先通设备有限公司; aka Zhongxing Weixiantong) for 49% and a private equity fund Guoxing Ruike (Chinese: 國興睿科) for 2.5%. :110–112", "The mixed ownership model of ZTE was described as \"a firm is an SOE from the standpoint of ownership, but a POE [privately owned enterprises] from the standpoint of management\", according to an article of Curtis J. Milhaupt and Zheng Wentong of Columbia University,"]},
{"Title": "Lenovo", "Organization_name": "Lenovo Group Limited", "Native name": "联想集团有限公司", "Type": "Public", "Traded as": "SEHK : 992 OTC Pink : LNVGY", "ISIN": "HK0992009065", "Industry": "Computer hardware Electronics", "Founded": "1 November 1984 ; 35 years ago (1984-11-01) (as Legend 联想) Beijing", "Founder": "Liu Chuanzhi", "Headquarters": "Haidian District, Beijing", "Area served": "Worldwide", "Key people": "Yang Yuanqing (Chairman & CEO) Gianfranco Lanci (COO) Yong Rui (CTO) Wong Wai Ming (CFO)", "Products": "Smartphones, desktops, servers, notebooks, tablet computers, netbooks, supercomputers, peripherals, printers, televisions, scanners, storage devices", "Revenue": "US$51.038 billion (2019)", "Operating income": "US$1.178 million (2019)", "Net income": "US$597 million (2019)", "Total assets": "US$28.49 billion (2018)", "Total equity": "US$51.038 billion (2019)", "Owner": "Legend Holdings (30.6%)", "Number of employees": "54,000 (2018) [ failed verification ]", "Subsidiaries": "Motorola Mobility ZUK Mobile Medion", "Website": "www.lenovo.com", "strings": ["Lenovo Group Limited, often shortened to Lenovo (/lɛˈnoʊvoʊ/ leh-NOH-voh), is a Chinese multinational technology company with headquarters in Beijing. It designs, develops, manufactures, and sells personal computers, tablet computers, smartphones, workstations, servers, electronic storage devices, IT management software, and smart televisions. Lenovo is the world's largest personal computer vendor by unit sales, as of March 2019. It markets the ThinkPad and ThinkBook business lines of notebook computers, IdeaPad, Yoga and Legion consumer lines of notebook laptops, and the IdeaCentre and ThinkCentre lines of desktops.", "Lenovo has operations in more than 60 countries and sells its products in around 160 countries. Lenovo's principal facilities are in Beijing and Morrisville (North Carolina, U.S.), with Chinese research centers in Beijing, Shanghai, Shenzhen, Xiamen, Chengdu, Nanjing, and Wuhan, Yamato (Kanagawa Prefecture, Japan), and Morrisville. It also has a joint venture with NEC, Lenovo NEC Holdings, which produces personal computers for the Japanese market.", "Lenovo was founded in Beijing in November 1984 as Legend and was incorporated in Hong Kong in 1988. Lenovo acquired IBM's personal computer business in 2005 and agreed to acquire its Intel-based server business in 2014. Lenovo entered the smartphone market in 2012 and as of 2014 was the largest vendor of smartphones in Mainland China. In 2014, Lenovo acquired the mobile phone handset maker Motorola Mobility from Google.", "Lenovo is listed on the Hong Kong Stock Exchange and is a constituent of the Hang Seng China-Affiliated Corporations Index, often referred to as \"Red Chips\".", "Liu Chuanzhi founded Lenovo on 1 November 1984 with a group of ten engineers in Beijing with 200,000 yuan. The Chinese government approved Lenovo's incorporation on the same day. Jiǎ Xùfú (贾续福), one of the founders of Lenovo, indicates the first meeting in preparation for starting the company was held on 17 October of the same year. Eleven people, the entirety of the initial staff, attended. Each of the founders was a middle-aged member of the Institute of Computing Technology attached to the Chinese Academy of Sciences. The 200,000 yuan used as start-up capital was approved by Zēng Màocháo (曾茂朝). The name for the company agreed upon at this meeting was the Chinese Academy of Sciences Computer Technology Research Institute New Technology Development Company.", "Their first significant effort, an attempt to import televisions, failed. The group rebuilt itself within a year by conducting quality checks on computers for new buyers. Lenovo soon started developing a circuit board that would allow IBM-compatible personal computers to process Chinese characters. This product was Lenovo's first major success. Lenovo also tried and failed to market a digital watch. Liu said, \"Our management team often differed on which commercial road to travel. This led to big discussions, especially between the engineering chief and myself. He felt that if the quality of the product was good, then it would sell itself. But I knew this was not true, that marketing and other factors were part of the eventual success of a product.\" The fact that its staff had little business experience compounded Lenovo's early difficulties. \"We were mainly scientists and didn't understand the market\", Liu said. \"We just learned by trial-and-error, which was very interesting—but also very dangerous\", said Liu. In 1990, Lenovo started to manufacture and market computers using its own brand name.", "In May 1988, Lenovo placed its first recruitment advertisement. The ad was placed on the front page of the China Youth News. Such ads were quite rare in China then. Out of the 500 respondents, 280 were selected to take a written employment exam. 120 of these candidates were interviewed in person. Although interviewers initially only had authority to hire 16 people, 58 were given offers. The new staff included 18 people with graduate degrees, 37 with undergraduate degrees, and three students with no university-level education. Their average age was 26. Yang Yuanqing, the current CEO of Lenovo, was among that group.", "Liu Chuanzhi received government permission to form a subsidiary in Hong Kong and to move there along with five other employees. Liu's father, already in Hong Kong, furthered his son's ambitions through mentoring and facilitating loans. Liu moved to Hong Kong in 1988. To save money during this period, Liu and his co-workers walked instead of taking public transportation. To keep up appearances, they rented hotel rooms for meetings.", "Lenovo became publicly traded after a 1994 Hong Kong listing that raised nearly US$30 million. Prior to its IPO, many analysts were optimistic about Lenovo. The company was praised for its good management, strong brand recognition, and growth potential. Analysts also worried about Lenovo's profitability. Lenovo's IPO was massively over-subscribed. On its first day of trading, the company's stock price hit a high of HK$2.07 and closed at HK$2.00. Proceeds from the offering were used to finance sales offices in Europe, North America and Australia, to expand and improve production and research and development, and to increase working capital.", "When Lenovo was first listed, its managers thought the only purpose of going public was to raise capital. They had little understanding of the rules and responsibilities that went along with running a public company. Before Lenovo conducted its first secondary offering in 1997, Liu proudly announced the company's intent to mainland newspapers only to have its stock halted for two days by regulators to punish his statement. This occurred several times until Liu learned that he had to choose his words carefully in public. The first time Liu traveled to Europe on a \"roadshow\" to discuss his company's stock, he was shocked by the skeptical questions he was subjected to and felt offended. Liu later came to understand that he was accountable to shareholders. He said, \"Before I only had one boss, but CAS never asked me anything. I relied on my own initiative to do things. We began to think about issues of credibility. Legend began to learn how to become a truly international company.\"", "To fund its continued growth, Lenovo issued a secondary offering of 50 million shares on the Hong Kong market in March 2000 and raised about US$212 million.", "Mary Ma, Lenovo's chief financial officer from 1990 to 2007, was in charge of investor relations. Under her leadership, Lenovo successfully integrated Western-style accountability into its corporate culture. Lenovo's emphasis on transparency earned it a reputation for the best corporate governance among mainland Chinese firms. All major issues regarding its board, management, major share transfers, and mergers and acquisitions were fairly and accurately reported. While Hong Kong-listed firms were only required to issue financial reports twice per year, Lenovo followed the international norm of issuing quarterly reports. Lenovo created an audit committee and a compensation committee with non-management directors. The company started roadshows twice per year to meet institutional investors. Ma organized the first-ever investor relations conference held in Mainland China. The conference was held in Beijing in 2002 and televised on CCTV. Liu and Ma co-hosted the conference and both gave speeches on corporate governance.", "In May 2015, Lenovo revealed a new logo at Lenovo Tech World in Beijing, with the slogan \"Innovation Never Stands Still\" (Chinese: 创新无止境). Lenovo's new logo, created by Saatchi, New York, can be changed by its advertising agencies and sales partners, within restrictions, to fit the context. It has a lounging \"e\" and is surrounded by a box that can be changed to use a relevant scene, solid color, or photograph. Lenovo's Chief Marketing Officer David Roman said, \"When we first started looking at it, it wasn't about just a change in typography or the look of the logo. We asked 'If we really are a net-driven, customer-centric company, what should the logo look like?' We came up with the idea of a digital logo first ... designed to be used on the internet and adaptable to context.\"", "In early June 2015, Lenovo announced plans to sell up to US$650 million in five-year bonds denominated in Chinese yuan. The bonds will be sold in Hong Kong with coupon ranging from 4.95% to 5.05%. This is only the second sale of bonds in Lenovo's history. Financial commentators noted that Lenovo was paying a premium to list the bonds in yuan given relatively low costs for borrowing in American dollars.", "The Tianxi computer was designed to make it easy for inexperienced Chinese consumers to use computers and access the Internet. One of its most important features was a button that instantly connected users to the Internet and opened the Web browser. It was co-branded with China Telecom and it was bundled with one year of Internet service. The Tianxi was released in 1998. It was the result of two years of research and development. It had a pastel-colored, shell-shaped case and a seven-port USB hub under its screen. As of 2000, the Tianxi was the best-selling computer in Chinese history. It sold more than 1,000,000 units in 2000 alone.", "Lenovo works to integrate the management of each newly acquired company into its larger culture. Lenovo has a dedicated mergers and acquisitions team that tracks the progress of these integrations. Lenovo has an annual meeting where the management of newly acquired companies meets with its top 100 executives. In these meetings, held in English, Lenovo explains its global strategy and how new executives fit into its plans.", "Lenovo acquired IBM's personal computer business in 2005, including the ThinkPad laptop and tablet lines.", "In regards to the purchase of IBM's personal computer division, Liu Chuanzhi said, \"We benefited in three ways from the IBM acquisition. We got the ThinkPad brand, IBM's more advanced PC manufacturing technology and the company's international resources, such as its global sales channels and operation teams. These three elements have shored up our sales revenue in the past several years.\"", "IBM acquired an 18.9% shareholding in Lenovo in 2005 as part of Lenovo's purchase of IBM's personal computing division.", "IBM's sold its Intel-based server lines, including IBM System x and IBM BladeCenter, to Lenovo in 2014.", "After closing, Lenovo said that its goal was to become the world's largest maker of servers. Lenovo also announced plans to start integrating IBM's workforce.", "Lenovo said that its x86 servers will be available to all its channel partners. Lenovo plans to cut prices on x86 products in order to gain market share.", "Lenovo's acquisition of IBM is arguably one of the greatest case studies on merging massive international enterprises. Though this acquisition in 2005 ultimately resulted in success, the integration of the businesses had a difficult and challenging beginning. Lenovo had employees from different cultures, different backgrounds, and different languages.", "Lenovo sold its smartphone and tablet division in 2008 for US$100,000,000 in order to focus on personal computers and then paid US$200,000,000 to buy it back in November 2009.", "Lenovo entered the smartphone market in 2012 and quickly became the largest vendor of smartphones in Mainland China.", "In May 2012, Lenovo announced an investment of US$793 million in the construction of a mobile phone manufacturing and R&D facility in Wuhan, China.", "On January 27, 2011, Lenovo formed a joint venture to produce personal computers with Japanese electronics firm NEC. The companies said in a statement that they would establish a new company called Lenovo NEC Holdings, to be registered in the Netherlands. NEC received US$175 million in Lenovo stock. Lenovo was to own a 51% stake in the joint venture, while NEC would have 49%. Lenovo has a five-year option to expand its stake in the joint venture.", "This joint venture was intended to boost Lenovo's worldwide sales by expanding its presence in Japan, a key market for personal computers. NEC spun off its personal computer business into the joint venture. As of 2010, NEC controlled about 20% of Japan's market for personal computers while Lenovo had a 5% share. Lenovo and NEC also agreed to explore cooperating in other areas such as servers and tablet computers.", "Roderick Lappin, chairman of the Lenovo–NEC joint venture, told the press that the two companies will expand their co-operation to include the development of tablet computers.", "In April 2014, Lenovo purchased a portfolio of patents from NEC related to mobile technology. These included over 3,800 patent families in countries around the world. The purchase included standards-essential patents for 3G and LTE cellular technologies and other patents related to smartphones and tablets.", "In June 2011, Lenovo announced that it planned to acquire control of Medion, a German electronics manufacturing company. Lenovo said the acquisition would double its share of the German computer market, making it the third-largest vendor by sales (after Acer and Hewlett-Packard). The deal, which closed in the third quarter of the same year, was the first in which a Chinese company acquired a well-known German company.", "This acquisition will give Lenovo 14% of the German computer market. Gerd Brachmann, chairman of Medion, agreed to sell two-thirds of his 60 percent stake in the company. He will be paid in cash for 80 percent of the shares and will receive 20 percent in Lenovo stock. That would give him about one percent of Lenovo.", "In September 2012, Lenovo agreed to acquire the Brazil-based electronics company Digibras, which sells products under the brand-name CCE, for a base price of 300 million reals (US$148 million) in a combination of stock and cash. An additional payment of 400 million reals was made dependent upon performance benchmarks.", "In September 2012, Lenovo agreed to acquire the United States-based software company Stoneware, in its first software acquisition. The transaction was expected to close by the end of 2012; no financial details have been disclosed.", "In September 2018 Lenovo and NetApp announced about strategic partnership and joint venture in China. As part of strategic partnership Lenovo started two new lines of storage systems: DM-Series and DE-Series. Both storage systems using Lenovo hardware and NetApp software: DM-Series using ONTAP OS and DE-Series SANtricity OS.", "LenovoEMC was a joint venture of Lenovo and EMC and offered network-attached storage (NAS) solutions. LenovoEMC's products were formerly offered under the Iomega brand name. As of 2018, lenovoemc.com now redirects to lenovo.com, and Lenovo has retired all of the LenovoEMC products on their product page advising that the product(s) are no longer available for purchase on lenovo.com.", "On 29 January 2014, Google announced it would sell Motorola Mobility to Lenovo for US$2.91 billion. When Google and Lenovo first announced the acquisition of Motorola, they said the purchase would be funded with $660 million in cash, $750 million in Lenovo stock, and a $1.5 billion promissory note due in three years. As of February 2014, Google owns about 5.94% of Lenovo's stock. The deal includes smartphone lines like the Moto X and Moto G and the Droid Turbo. Lenovo also got the future Motorola Mobility product roadmap. Google will retain the Advanced Technologies & Projects unit and all but 2,000 of the company's patents.", "Lenovo has stated that Motorola was purchased in large part due to its long-standing relationships with cellular network operators in the United States and the United Kingdom. Lenovo previously had difficulty breaking into the United Kingdom due to the high proportion of customers who sign contracts and receive phones from carriers. A Lenovo executive said, \"There are lots of reasons why we bought Motorola but primarily because it has a history of distribution in the UK. Motorola has long and established relationships with routes to market in North America and the UK, where people are tied to their network operator.\"", "Lenovo received approval from the European Union for its acquisition of Motorola in June 2014. In a statement the European Union said, \"The Commission concluded that the proposed acquisition would not raise competition concerns in relation to smart mobile devices (smartphones and tablets), given the limited market position of the parties and the presence of other strong suppliers in the market.\" At the time of the EU approval Lenovo said it was on track to win final approval of the merger in the United States.", "The acquisition was completed on 30 October 2014. Motorola Mobility will remain headquartered in Chicago, and continue to use the Motorola brand, but Liu Jun, president of Lenovo's mobile device business, became the company's leader.", "In March 2017, Lenovo announced it was partnering with Fort Lauderdale, Florida-based software storage virtualization company DataCore to add DataCore's parallel I/O-processing software to Lenovo's storage devices.", "In 2017 Lenovo formed a joint venture with Fujitsu and the Development Bank of Japan. In the joint venture, Fujitsu will sell Lenovo a 51% stake in Fujitsu Client Computing Limited. DBJ will acquire a 5% stake.", "In 2018, Lenovo became the world's largest provider for the TOP500 supercomputers.", "\"Lenovo\" is a portmanteau of \"Le-\" (from Legend) and \"novo\", Latin ablative for \"new\". The Chinese name (simplified Chinese: 联想; traditional Chinese: 聯想; pinyin: Liánxiǎng) means \"association\" (as in \"word association\") or \"connected thinking\". It can also imply creativity.", "For the first 20 years of its existence, the company's English name was \"Legend\" (Chinese: 联想; Liánxiǎng). In 2002, Yang Yuanqing decided to abandon the Legend brand name to expand internationally. \"Legend\" was already in use by many businesses worldwide (whose products and services (in the United States, for example), would include those from both the technological and non-technological arenas of industry and commerce),", "Lenovo markets the ThinkPad line of notebook computers, IdeaPad, Yoga and Legion lines of notebook laptops, and the IdeaCentre and ThinkCentre lines of desktops.", "The ThinkPad is a line of business oriented laptop computers known for their boxy black design, modeled after a traditional Japanese lunchbox.", "The ThinkCentre is a line of business-oriented desktop computers which was introduced in 2003 by IBM and since has been produced and sold by Lenovo since 2005.", "The ThinkServer product line began with the TS100 from Lenovo.", "Lenovo ThinkStations are workstations designed for high-end computing. In 2008, Lenovo expanded the focus of its THINK brand to include workstations, with the ThinkStation S10 being the first model released.", "High-end monitors are marketed under the ThinkVision name. ThinkVision displays share a common design language with other THINK devices such as the ThinkPad line of notebook computers and ThinkCentre desktops. At the 2014 International CES, Lenovo announced the ThinkVision Pro2840m, a 28-inch 4K display aimed at professionals. Lenovo also announced another 28-inch 4K touch-enabled device running Android that can function as an all-in-one PC or an external display for other devices.", "At the 2016 International CES, Lenovo announced two displays with both USB-C and DisplayPort connectivity. The ThinkVision X24 Pro monitor is a 24-inch 1920 by 1080 pixel thin-bezel display that uses an IPS LCD panel. The ThinkVision X1 is a 27-inch 3840 by 2160 pixel thin-bezel display that uses a 10-bit panel with 99% coverage of the sRGB color gamut. The X24 includes a wireless charging base for mobile phones. The X1 is the first monitor to receive the TUV Eye-Comfort certification. Both monitors have HDMI 2.0 ports, support charging laptops, mobile phones, and other devices, and have Intel RealSense 3D cameras in order to support facial recognition. Both displays have dual-array microphones and 3-watt stereo speakers.", "The IdeaPad line of consumer-oriented laptop computers was introduced in January 2008. The IdeaPad is the result of Lenovo's own research and development; Unlike the ThinkPad line, its design and branding were not inherited from IBM. The IdeaPad's design language differs markedly from the ThinkPad and has a more consumer-focused look and feel.", "On September 21, 2016, Lenovo confirmed that their Yoga series is not meant to be compatible with Linux operating systems, that they know it is impossible to install Linux on some models, and that it is not supported.", "All IdeaCentres are all-in-one machines, combining processor and monitor into a single unit.", "At CES 2011, Lenovo announced the launch of four IdeaCentre desktops: the A320, B520, B320, and C205.", "In 2013, Lenovo added a table computer to the IdeaCentre line. The Lenovo IdeaCentre Horizon Table PC, introduced at the 2013 International CES is a 27-inch touchscreen computer designed to lay flat for simultaneous use by multiple people. Thanks to its use of Windows 8, the Horizon can also serve as a desktop computer when set upright.", "As of January 2013, Lenovo only manufactured phones that use the Android operating system from Google. Numerous press reports indicated that Lenovo planned to release a phone running Windows Phone 8, According to J. D. Howard, a vice president at Lenovo's mobile division, the company would release a Windows Phone product if there is market demand.", "Lenovo has implemented an aggressive strategy to replace Samsung Electronics as Mainland China market's top smartphone vendor. It has spent $793.5 million in Wuhan in order to build a plant that can produce 30 to 40 million phones per year. Data from Analysys International shows that Lenovo experienced considerable growth in smartphone sales in China during 2012. Specifically, it saw its market share increase to 14.2% during 2012's third quarter, representing an increase when compared to 4.8% in the same quarter of 2011. IDC analysts said that Lenovo's success is due to its \"aggressive ramping-up and improvements in channel partnerships.\" Analysys International analyst Wang Ying wrote, \"Lenovo possesses an obvious advantage over rivals in terms of sales channels.\" The company's CEO, Yang Yuanqing, said, \"Lenovo does not want to be the second player ... we want to be the best. Lenovo has the confidence to outperform Samsung and Apple, at least in the Chinese market.\"", "According to IHS iSuppli, Lenovo was a top-three smartphone maker in China with a 16.5% market share in the first quarter of 2012. According to a May report released by IDC Lenovo ranks fourth in the global tablet market by volume.", "In May 2013, Lenovo CEO Yang Yuanqing indicated that the company had aimed to release smartphones in the United States within the next year. Later in October, Lenovo expressed interest in acquiring the Canadian smartphone maker BlackBerry Ltd. However, its attempt was reportedly blocked by the Government of Canada, citing security concerns due to the use of BlackBerry devices by prominent members of the government. An official stated that \"we have been pretty consistent that the message is Canada is open to foreign investment and investment from China in particular but not at the cost of compromising national security\".", "In January 2014, Lenovo announced a proposed deal to acquire Motorola Mobility to bolster its plans for the U.S. market.", "Lenovo plus Motorola was the 3rd largest producer of smartphones by volume in the world between 2011 and 2014.", "In the reorganization which followed, Lenovo was uncertain how to brand its Motorola smartphones. In November 2015, members of Lenovo management made statements that Lenovo would use the Motorola brand for all its smartphones.", "In November 2011, Lenovo said it would soon unveil a smart television product called LeTV, expected for release in the first quarter of 2012. \"The PC, communications and TV industries are currently undergoing a 'smart' transformation. In the future, users will have many smart devices and will desire an integrated experience of hardware, software and cloud services.\" Liu Jun, president of Lenovo's mobile-Internet and digital-home-business division.", "Rumors that Lenovo was developing a wearable device were confirmed in October 2014 after the company submitted a regulatory finding to the Federal Communications Commission. The device, branded a \"Smartband\", has a battery life of seven days. It has an optical heart-rate monitor and can be used to track distance and time spent running and calories burned. It can also notify the user of incoming calls and texts.", "In 2015 Lenovo launched a strategic cooperation with IngDan, a subsidiary of the Cogobuy Group to penetrate into the intelligent hardware sector.", "At the Mobile World Congress in 2016 Lenovo introduced Lenovo Connect, a wireless roaming service. This service works across devices, networks, and international borders in China, Europe, the Middle East, and Africa. Lenovo Connect eliminates the need to buy new SIM cards when crossing borders. Lenovo Connect started service for phones and select ThinkPad laptops in China in February 2016.", "Lenovo's principal facilities are in Beijing, Morrisville, North Carolina and Singapore, with research centers in Beijing, Morrisville, Shanghai, Shenzhen, Xiamen, Chengdu, Nanjing,", "Lenovo's manufacturing operations are a departure from the usual industry practice of outsourcing to contract manufacturers. Lenovo instead focuses on vertical integration in order to avoid excessive reliance on original equipment manufacturers and to keep down costs.", "Lenovo began to emphasize vertical integration after a meeting in 2009 in which CEO Yang Yuanqing, and the head of Lenovo's supply chain, analyzed the costs versus the benefits of in-house manufacturing, and decided to make at least 50% of Lenovo's manufacturing in-house. Lenovo Chief Technology Officer George He said that vertical integration is having an important role in product development. He stated, \"If you look at the industry trends, most innovations for\" PCs, smartphones, tablets and smart TVs are related to innovation of key components—display, battery and storage. Differentiation of key parts is so important. So we started investing more ... and working very closely with key parts suppliers.\"", "In 2012, Lenovo partially moved production of its ThinkPad line of computers to Japan. ThinkPads will be produced by NEC in Yamagata Prefecture. Akaemi Watanabe, president of Lenovo Japan, said, \"As a Japanese, I am glad to see the return to domestic production and the goal is to realize full-scale production as this will improve our image and make the products more acceptable to Japanese customers.\"", "In October 2012, Lenovo announced that it would start assembling computers in Whitsett, North Carolina. Production of desktop and laptop computers, including the ThinkPad Helix began in January 2013. As of July 2013[update], 115 workers were employed at this facility. Lenovo has been in Whitsett since 2008, where it also has centers for logistics, customer service, and return processing.", "In 2015, Lenovo and Hong Kong Cyberport Management Company Limited, a government-sponsored business park for technology firms, reached a deal to \"jointly build a cloud service and product research and development center\".", "Lenovo assembles smartphones in Chennai, India through a contract manufacturing agreement with Flextronics.", "The company executive headquarters are in Morrisville, North Carolina,", "Previously the company's U.S. headquarters were in Purchase, Harrison, New York. About 70 people worked there. In 2006, Lenovo announced that it was consolidating its U.S. headquarters, a logistics facility in Boulder, Colorado, and a call center in Atlanta, Georgia, to a new facility in Morrisville. The company received offers of over $11 million in incentive funds from the local Morrisville, North Carolina, area and from the State of North Carolina on the condition that the company employs about 2,200 people.", "From 4 March 2013, Lenovo was included as a constituent stock in the Hang Seng Index. Lenovo replaced the unprofitable Aluminum Corp of China, a state-owned enterprise, on the list of 50 key companies on the Hong Kong stock exchange that constitute the Hang Seng Index.", "Lenovo is the world's largest personal computer vendor by unit sales from 2013 to 2015.", "Lenovo was able to reclaim its top spot in PC market share 2018.", "In 2009, China Oceanwide Holdings Group, a private investment firm based in Beijing, bought 29% of Legend Holdings, the parent company of Lenovo, for 2.76 billion yuan.", "Responding to claims that Lenovo is a state-owned enterprise CEO Yang Yuanqing said: \"Our company is a 100% market oriented company. Some people have said we are a state-owned enterprise. It's 100% not true. In 1984 the Chinese Academy of Sciences only invested $25,000 in our company. The purpose of the Chinese Academy of Sciences to invest in this company was that they wanted to commercialize their research results. The Chinese Academy of Sciences is a pure research entity in China, owned by the government. From this point, you could say we're different from state-owned enterprises. Secondly, after this investment, this company is run totally by the founders and management team. The government has never been involved in our daily operation, in important decisions, strategic direction, nomination of the CEO and top executives and financial management. Everything is done by our management team.\"", "In early 2006, the U.S. State Department was harshly criticized for purchasing 16,000 computers from Lenovo. Critics argued that Lenovo was controlled by the Chinese government and a potential vehicle for espionage against the United States. Yang spoke out forcefully and publicly to defend Lenovo. He said, \"We are not a government-controlled company.\" He pointed out that Lenovo pioneered China's transition to a market economy and that in the early 1990s had fought and beaten four state-owned enterprises that dominated the Chinese computer market. Those firms had the full backing of the state while Lenovo received no special treatment. The State Department deal went through. Yang worried that fears about Lenovo's supposed connections to the Chinese government would be an ongoing issue in the United States. Yang worked to ease worries by communicating directly with Congress.", "Yang dramatically increased his ownership stake by acquiring 797 million shares in 2011. As of June 2011, Yang owned an 8 percent stake in Lenovo. He previously owned only 70 million shares. In a statement, Yang said, \"While the transaction is a personal financial matter, I want to be very clear that my decision to make this investment is based on my strong belief in the company's very bright future. Our culture is built on commitment and ownership – we do what we say, and we own what we do. My decision to increase my holdings represents my steadfast belief in these principles.\"", "Lenovo's corporate culture differs from other Chinese companies. While Lenovo was founded using seed capital from the state-owned Chinese Academy of Sciences, Lenovo is run as a private enterprise with little or no interference by the state. Lenovo's senior executives, including many non-Chinese, rotate between two head offices, one in Beijing and the other in Morrisville, North Carolina, and Lenovo's research and development center in Japan. Two foreigners have previously served as Lenovo's CEO.", "English is Lenovo's official language. Lenovo's CEO, Yang Yuanqing, initially did not understand English well, but relocated his family to Morrisville to improve his language skills and learn American ways. One American Lenovo executive interviewed by The Economist praised Yang for his efforts to make Lenovo a friendly place for foreigners to work. He said that Yang had created a \"performance culture\" in place of the traditional Chinese work style of \"waiting to see what the emperor wants\".", "Yang Yuanqing is the chairman and chief executive officer of Lenovo. One of his major achievements was leading Lenovo to become the best-selling personal computer brand in China since 1997. In 2001, Business Week named him one of Asia's rising stars in business. Yang was president and CEO of Lenovo until 2004, when Lenovo closed its acquisition of IBM's PC division, after which Yang was succeeded as Lenovo CEO by IBM's Stephen M. Ward, Jr. Ward was succeeded by Bill Amelio on 20 December 2005. In February 2009, Yang replaced Amelio as CEO and has served in that capacity ever since. Yang was chairman of Lenovo's board from 2004 to 2008, and returned as chairman in 2012 alongside his role as CEO.", "In 2012, Yang received a $3 million bonus as a reward for record profits, which he in turn redistributed to about 10,000 of Lenovo's employees. According to Lenovo spokesman, Jeffrey Shafer, Yang felt that it would be the right thing to, \"redirect [the money] to the employees as a real tangible gesture for what they done.\" Shafer also said that Yang, who owns about eight percent of Lenovo's stock, \"felt that he was rewarded well simply as the owner of the company.\"", "According to Lenovo's annual report, Yang earned $14 million, including $5.2 million in bonuses, during the fiscal year that ended in March 2012.", "In 2013, Barron's named Yang one of the \"World's Best CEOs\".", "Liu Chuanzhi is the founder and chairman of Lenovo. Liu was trained as an engineer at a military college and later went on to work at the Chinese Academy of Sciences. Like many young people during the Cultural Revolution, Liu was denounced and sent to the countryside where he worked as a laborer on a rice farm. Liu claims Hewlett-Packard as a key source of inspiration. In an interview with The Economist he stated that \"Our earliest and best teacher was Hewlett-Packard.\" For more than ten years, Lenovo was Hewlett-Packard's distributor in China.", "In early 2013, Lenovo announced the addition of Yahoo founder Jerry Yang to its board. Lenovo's CEO Yang Yuanqing said, \"Jerry's appointment as an observer to our board furthers Lenovo's reputation as a transparent international company.\" Just prior to the appointment of Jerry Yang, Tudor Brown, the founder of British semiconductor design firm ARM, was also appointed to Lenovo's board. Speaking of both men Yang Yuanqing said, \"We believe that they will add a great deal to our strategic thinking, long-term direction and, ultimately, our ability to achieve our aspirations in the PC plus era.\"", "In 2009, Lenovo became the first personal computer manufacturer to divide countries into emerging markets and mature markets. Lenovo then developed a different set of strategies for each category. Lenovo's competitors have widely adopted the same approach", "In 2012, Lenovo made a major effort to expand its market share in developing economies such as Brazil and India through acquisitions and increased budgets for marketing and advertising. While Lenovo has not revealed its total spending on marketing, it did increase marketing and advertising expenditures by $248 million in the fiscal year ending in 2012.", "In China, Lenovo has a vast distribution network designed to make sure that there is at least one shop selling Lenovo computers within 50 kilometers of nearly all consumers. Lenovo has also developed close relationships with its Chinese distributors, who are granted exclusive territories and only carry Lenovo products.", "As of July 2013, Lenovo believes that urbanization initiatives being pushed by Premier Li Keqiang will allow it to sustain sales growth in China for the foreseeable future. Speaking at Lenovo's annual general meeting in Hong Kong in 2013, Yang Yuanqing said: \"I believe urbanisation will help us further increase the overall [domestic] PC market.\" Yang also stressed the opportunity presented by the China's relatively low penetration rate of personal computers. Lenovo previously benefited from the Chinese government's rural subsidies, part of a wider economic stimulus initiative, designed to increase purchases of appliances and electronics. That program, which Lenovo joined in 2004, ended in 2011. Lenovo enjoys consistent price premiums over its traditional competitors in rural markets and a stronger local sales and service presence.", "Lenovo has gained significant market share in India through bulk orders to large companies and government agencies. For example, the government of Tamil Nadu ordered a million laptops from Lenovo in 2012 and single-handedly made the firm a market leader. Lenovo distributes most of the personal computers it sells in India through five national distributors such as Ingram Micro and Redington.", "Given that most smartphones and tablets are sold to individuals Lenovo is pursuing a different strategy making use of many small state-centric distributors. Amar Babu, Lenovo's managing director for India, said, \"To reach out to small towns and the hinterland, we have tied up with 40 regional distributors. We want our distributors to be exclusive to us. We will, in turn, ensure they have exclusive rights to distribute Lenovo products in their catchment area.\""]}
]